[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
'
,
.
0
1
2
3
4
5
6
7
8
9
;
?
_
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
##k
##i
##f
##u
##n
##g
##r
##a
##z
##o
##m
##4
##8
##5
##2
##6
##e
##t
##b
##y
##s
##h
##p
##c
##v
##w
##0
##d
##j
##l
##q
##3
##9
##7
##1
##x
##an
##ri
##ra
mu
##ga
##ba
##re
##sh
ku
##wa
##ya
##ye
##ko
ba
##in
##ma
##ka
##we
##za
##mu
##it
ya
##yo
##gi
##ge
##ru
##bi
##bu
##zi
##go
##da
##bo
##ze
##ta
##yi
##se
umu
##ki
##tu
##ro
ko
##ku
##me
##te
gu
in
aba
bi
##ho
##gu
##di
##si
##ana
##ha
im
na
wa
##wi
##ti
##vu
ubu
##he
##yu
ama
##ban
##hu
##be
bu
ha
##je
##sha
##yan
##wan
##mo
ni
muri
##sa
##wo
##ite
##ran
##de
ka
ari
##li
##on
##tan
##shi
##rwa
ibi
ki
##fa
##ke
ru
ma
ib
##mwe
##en
##wanda
##gan
gi
##mi
aban
##tse
##han
igi
##du
##zo
##so
##gira
iki
##ita
##kin
##to
ngo
##mba
kan
cyan
##vuga
rwanda
##kuru
##gen
##bwo
yo
##bere
##na
##fu
##hi
##hugu
ga
##gwa
##kan
ic
20
no
##gara
bya
##zwe
uru
kuri
aka
##san
##sho
##kore
cya
nta
##fite
tu
##nge
kandi
##ne
##le
zi
##men
##shin
we
##va
uko
mi
##cu
##bwa
kwi
##yobo
##kome
##kun
##su
imi
ariko
hari
##giye
kuba
##ts
##ce
##rere
##pe
##zu
##do
##ina
by
nde
za
kuko
ati
##shyi
um
uyu
##vi
##iti
##or
##riki
umun
bo
##ini
ri
##kora
aho
##la
co
re
##ryo
ndetse
##ci
##rika
##shu
##shobo
##tanga
##bwi
##yuma
cyane
##ca
##ve
##pa
bari
ye
##yama
##jya
the
an
abantu
##mbi
##gera
bwa
bw
cy
##tege
nk
##korwa
le
ne
yi
201
mun
##yaka
abatu
##yobozi
se
##mbo
pe
##biri
igihugu
byo
##nda
##jwe
##nga
ubwo
pa
yari
cyangwa
##she
##bera
ibyo
icyo
rwa
gihe
##rezi
du
##bye
##tsi
rya
ban
iyo
##itwa
##kaba
##rage
##itan
mbere
##ira
ry
##ni
##bona
rw
nyuma
##gabo
##hin
avuga
iyi
##garaga
to
sa
##shaka
##gize
##bazo
iz
ra
de
aga
##zwa
##pu
##hanga
##riye
##kwi
##ndi
##ngu
##rimo
##vuze
be
##yango
##kanye
##indi
nti
cyo
19
po
kugira
##ine
##faran
##man
##rana
##shobora
##maze
##twa
##bana
##shya
##00
##kana
##mana
ta
##itu
##tera
##st
##ryango
##tion
##rwanda
nya
twa
neza
##waka
##rezida
wo
##gore
##co
bwo
gusa
igihe
##kira
##il
perezida
##wu
##kino
##zima
##jye
##enshi
##mbu
##reza
and
##byi
leta
kiga
##rira
##riza
##tsin
##ji
abaturage
ata
##ren
abandi
##gana
imyaka
##gani
##by
iri
##inshi
##ruka
##lo
uku
##fasha
of
kigali
##faranga
##shuri
##baye
##renge
da
##ngo
##fi
##geze
bara
##inis
##yarwanda
izina
umuntu
buryo
umwe
##geza
##ani
##po
##rwe
##bya
##mva
isi
si
nu
buri
##ter
##pi
##kuriki
##ing
##menye
##tegeko
yavuze
zo
aha
ig
ikin
##saba
bata
##ganda
##gomba
##por
kubera
##shyira
##ja
##al
##gura
##ciro
##shimi
minis
##dukanye
akaba
imbere
baka
mo
##wanya
kwa
##ment
##nye
##wana
uwo
##komeza
##nyi
tariki
##one
imana
##rezo
abo
##zaba
vi
##sanga
ho
##yon
baba
amafaranga
##sanzwe
han
abana
##bwe
yan
##ranye
ara
abi
bita
kw
##subi
##un
he
rwe
me
##tum
te
##ur
##shinzwe
gihugu
202
com
##rin
##raga
##yamakuru
##komeye
##ju
##kwa
yagize
nka
##yaha
##koze
mwaka
##fo
##bura
ame
di
##kobwa
##zamu
##sin
##ue
nda
##jyi
##shyu
munsi
benshi
so
karere
afu
##intu
##kiri
spor
##shwa
##koresha
##mbe
ita
ca
gukora
##guru
##ito
##curu
haga
##pr
##fata
##shan
yara
fc
##korera
##ama
kaga
poli
##banu
##bwira
con
##pam
umuyobozi
bite
rwo
##bone
##zira
##rs
bose
##buga
##zama
ikipe
##ss
ad
byi
niba
ubuzima
##garagaza
indi
amakuru
mili
wi
uburyo
uwa
##osi
##tara
aza
##jyan
baga
##komeje
kugeza
##ngera
kwe
##byo
##ham
##ll
##rya
afurika
kuva
##itiri
##pan
##kunda
sports
rayon
##genda
##pamvu
bamwe
byose
ahu
##yeme
afite
##seze
##kura
rwego
##dwa
baza
##shize
##er
##shije
##insi
batu
##kinnyi
##fatan
la
wari
##tangiye
##yoni
##shinga
##reke
2020
##pfu
##genzi
jen
80
hagati
umuryango
##rutse
bafite
je
af
fa
##hindu
abanyarwanda
uganda
##gere
##sobanu
yaba
mukuru
do
pro
##kwe
inama
##mbere
##oside
inte
ibindi
ahan
gute
inga
guha
10
jenoside
akarere
is
gahu
##ingo
umugore
##menya
##gari
ikibazo
##kwiye
fi
##gisha
ntabwo
##ota
kumu
##el
baha
##kene
bavuga
##twe
##zan
gahunda
iza
##kozi
ibikorwa
ahubwo
##tsinda
kagame
##mvi
##riya
umwana
##rimbo
##vid
yu
##jyanye
kabiri
su
bitan
##gami
##tuma
##hanzi
##hita
##cyo
##jo
li
##rt
hi
harimo
##hari
imba
al
##korana
ibintu
##ry
##ire
for
amerika
##mera
polisi
dago
##bonye
##byte
##renga
dagobyte
miliyoni
##tangira
##oni
##mail
abatutsi
##garagara
##itse
kin
##shwe
2019
##van
ny
##ris
jean
##mbwa
umute
##ul
##zego
cyu
##ganiro
##shye
##kiko
jo
##bwiye
##mweru
nyi
##reba
amategeko
byinshi
ndi
email
buru
##hise
en
##iteri
##here
##its
nawe
itera
##kano
mpu
covid
umugabo
minisitiri
##rusha
icya
##tangi
##vugwa
##no
hamwe
##rinda
ibibazo
##mere
##tanu
ibya
bamu
##vuye
##bare
##fe
bikorwa
kimwe
##ch
maze
itanga
##rasi
##byeyi
kujya
##yana
99
##tumwa
##horo
000
##banza
aya
kubi
naho
##tare
##iteke
ubuyobozi
##inyu
##ywa
##kiye
##gaban
ge
15
##zuba
un
iba
bira
##teka
##riro
##rd
dr
##lu
##fun
##ramo
ibihugu
umutekano
gutanga
as
sta
##siga
mwa
##humbi
##rano
##que
akazi
uta
nko
ika
##sanze
##seke
are
pu
##gendo
##yije
rero
yabo
ira
##tegetsi
##es
ubuta
yose
witwa
##tora
##curuzi
iso
##sirika
kubona
##rengan
##mari
nku
ubwi
man
##fashe
##dwara
##guye
##ruko
##dan
kam
##ric
##rije
12
none
bakaba
mwi
##soho
##tin
##sange
##baza
##tandukanye
##gano
ro
199
umwaka
ugu
utu
##sirikare
##mye
##kina
##bili
##byiruko
biza
wese
2018
go
abagore
##shy
##sore
##yiza
yaha
##ven
##ganira
##rw
yakore
##swa
##hare
200
umukino
##ngi
##rwanya
##rangi
bwi
##ngereza
izi
##fuza
ufite
##mp
##hova
uri
kugi
bihugu
##lika
undi
##moka
hafi
##shanwa
ikigo
##sabye
##gingo
iminsi
muntu
rusange
##doka
bitu
##itego
aman
abayobozi
##banga
##ganya
barimo
##jyana
##pfo
##tangaje
##itekerezo
babi
imwe
##sezerano
hu
apr
umujyi
bit
rugo
nubwo
##tanda
##rus
ti
##shyize
##inu
##ywe
##gero
ke
##ent
##menyi
##rane
agira
##ver
##hura
ubumwe
ayo
##zwi
##gizi
##mbye
wan
25
##toza
mujyi
##dio
##kundo
##yuba
nkuru
##ene
isa
my
11
indirimbo
##handa
##ranya
ryo
umusa
18
uruhare
biba
umwi
##retse
abari
ibihumbi
##gende
uza
amu
impamvu
kugera
abakinnyi
##ruro
##rona
murenge
biga
##ly
iterambere
bamaze
ar
ur
umuseke
##tumye
umwa
##fati
##hinzi
yehova
hanze
##zina
kubu
tura
##tore
##faransa
##mbara
minisiteri
##mun
##tso
##ton
au
paul
##juru
##kungu
##ir
ja
mukino
amavu
##mara
inzego
##day
nibwo
gata
ab
atari
abanya
biri
amaze
##ndo
##kipe
ifite
##reka
##huza
amazi
agaciro
ubundi
repu
iha
14
nyama
##rire
##razuba
##shimira
itegeko
##gambo
##mwa
##rango
##zamakuru
cye
##pera
##ws
##th
umutu
##mbuye
##rongo
imbaraga
bityo
##tandatu
twi
##lle
mpuzama
kuza
13
bantu
##foto
umukobwa
kibazo
inshu
on
##ronavi
tan
##kombe
##gene
##bereye
thi
##yobora
rwi
umunsi
bitandukanye
##shobozi
##hora
##hampi
mar
##yeshuri
amaso
##pira
radio
abakozi
cyumweru
##ranga
##twara
mpuzamahanga
##lan
myaka
##bli
ingabo
izindi
##singi
##tima
##pfa
ubwa
##nzi
##rica
amashuri
30
##zweho
haba
##bwiriza
impu
##og
mpamvu
##mwi
urubyiruko
##rani
##ganga
nyinshi
##buhanga
bana
##bazi
tele
bagiye
gushyira
impan
gicu
saa
nabo
imikino
##mura
16
et
muka
ju
uba
##hana
kurusha
##mira
##itanga
##ken
##is
ivuga
ub
wil
##liti
##rera
##ds
##sheje
umuvu
uka
##shyirwa
azi
gatatu
bwe
##enya
##hat
##bira
17
##teye
##genga
kun
##tive
##meza
##shyura
##fashi
kwan
ushinzwe
##ranira
amahoro
today
##hirwe
##uba
ikorana
2017
fo
kwirinda
##haye
##qu
##ogle
inta
##shinja
uburezi
##tri
indwara
nan
##kunze
##rirwa
##ronavirus
##gire
inzu
##yeho
ishuri
##rushanwa
##hera
##shami
##den
##senge
##ste
izo
##herere
nabi
##nd
##fatwa
##inji
##rayi
byari
coronavirus
vie
##shimiye
##poro
umwu
##inuza
urukiko
inyu
##kozwe
inko
umwanya
##tsinze
kwiga
ukuri
##yandi
yakorewe
ibiri
at
ikindi
nzi
mata
umunyama
ikoranabuhanga
fran
##cyaha
ze
kaminuza
##hoze
rimwe
##ruki
##sby
bakora
##renze
ruhan
umusaruro
muryango
##siyo
icyi
isu
yon
es
ruba
##google
ntara
adsby
adsbygoogle
##fashwe
umusingi
##koreshwa
##riwe
ac
kigo
fe
##bwenge
##buka
amazina
nama
##fungu
kumenya
kom
tw
yakomeje
ingu
##kara
##ck
##ity
nkuko
##zere
##kunga
kwezi
ibyaha
##uka
##hamwe
bahu
##ganyi
birimo
bitewe
repubu
##kwira
##rwego
babo
bazi
views
abagabo
usanga
##rimi
inyuma
##paka
baki
##fana
mba
cyi
ubutegetsi
kwita
bikaba
##renganzira
abakobwa
##itsina
this
##unze
##zani
kure
uga
##can
ingaruka
isoko
##kunzi
##yari
buta
##shingiye
##garagaje
gushaka
##shoboye
imo
kurwanya
icyorezo
kuvuga
##banda
iby
##goro
##menyetso
ikinyamakuru
nza
itangazamakuru
repubulika
niyo
ntiba
twe
ubushobozi
##rwayi
menshi
bika
##iton
kuyi
##tanze
bihe
abe
shampi
##ramu
ikaba
inda
##itabo
guve
##mbaga
imodoka
gukomeza
bate
##koresho
ngombwa
kenya
##vura
iya
byiza
##habwa
##ditse
zitan
##shingano
##vo
inde
nte
lo
kugirango
inkuru
##sig
minsi
##hungu
##yemezo
iga
bati
mwe
yahise
urwego
ababyeyi
africa
buzima
yabwiye
kana
ex
##shyaka
bada
##shoboka
yitwa
not
ahantu
seri
##keneye
ada
##yongera
##meze
bimwe
##bikorwa
bibili
ij
##yona
##kera
inter
bibiliya
##yamama
##mes
burundi
##jira
will
ubukungu
imari
bituma
ali
urukundo
intara
##tero
##che
kuwa
##ble
##ino
##tal
##mban
##visi
uburenganzira
##fatanya
##shyigi
##subiza
##shyan
muse
##ria
21
id
sen
##ona
shampiyona
amanota
##gamije
##tsa
1994
##hagara
bagera
##shatsi
umunyamabanga
##genge
##mbura
ubucuruzi
cha
icyaha
tv
inzo
hejuru
##us
mugabo
amahirwe
mwanya
itu
##rizwa
##shakashatsi
kumwe
gufata
##jije
fla
politi
yamu
##kurikira
##yemo
abanyamakuru
umurenge
frw
bijyanye
ako
##ruguru
gen
yatangaje
##gije
##pite
guta
24
aki
yabaye
ubumenyi
##gamba
##dana
zose
kubaka
##umu
gukoresha
##kuba
##kereza
kipe
ade
imirimo
ana
##kire
##rukiya
ibiro
##meye
##gh
##inya
##fatanye
##ano
binyu
hose
##ar
##gabane
congo
that
uw
##ndu
mutara
ubutumwa
amasezerano
ibigo
##hamya
itsinda
gatanu
tanzani
nayo
mura
ese
hano
##ssi
ashobora
igice
##dugu
turi
##injira
imy
##bon
bida
##torero
kazi
ch
umupira
##hangana
##genzu
##sen
ukubo
##zana
##boneka
##mena
##bara
yagiye
atu
kiri
##les
nzu
wu
##mb
umuco
yaje
ura
##hariko
kane
##pfuye
##kazi
flash
##itaramo
##bc
##maga
##dugudu
publi
gato
##kanga
##suzu
##giza
comment
##garu
##zuro
##rekana
nyira
udu
##girwa
##higo
##banze
##sabwa
dore
##ser
##sigiti
##shusho
uretse
ce
##nze
##sigaye
##poli
nyan
gutera
##rangwa
##tswe
bye
byaba
##kaza
##shyantare
bagomba
##oma
##sta
##kanya
22
yatangiye
zunze
yakoze
ibyi
imiryango
##jambo
##saga
umwami
yombi
gashyantare
kongera
##joro
ruta
ukwe
amateka
##kurikirana
abanyeshuri
##ks
gutu
kibuga
##zera
##geje
##bs
##banje
gufasha
##bereho
umwan
##ld
cla
umuvugizi
##haga
##hara
igikombe
##shatse
or
umubare
##rinoma
##gizwe
nshu
umunya
##itsi
##sco
zitandukanye
indege
23
##indu
##tions
musanze
ibu
amakipe
##rusi
umwihariko
guverinoma
##guri
##dre
##kub
ijambo
##ith
##korerwa
adepr
tuza
babiri
ntu
##ted
bajya
mutarama
##rurwe
yabi
##itanye
##ganye
umutwe
uwi
##mbwe
agiye
2016
umubiri
kiganiro
##inga
##rea
##hango
umuhanzi
##rwan
##shora
werurwe
mwiza
##hano
##gambi
ite
##sobanura
##yumba
ishami
ukwa
cu
##mini
baturage
kita
##saha
serivisi
##the
##ganyijwe
##polisi
ejo
##rabu
##ms
bagenzi
komi
umurwa
##rine
intwa
##giro
koko
ate
##sozi
##yimana
iryo
ikintu
##hereza
wawe
nziza
itariki
100
lin
rwose
kiza
nuko
##dika
gatandatu
##gwe
njye
ida
bikomeye
##cya
##rangira
amabwiriza
police
ingamba
##shyamba
inka
kuvu
##yumvi
##mero
##maro
##garuka
imp
win
dufite
bro
wabo
ibihe
##hindura
time
san
##muga
##hunga
ukuboza
iwa
gikorwa
26
ukun
umusigiti
nshya
##reye
it
pre
miss
##ting
bigo
ukwezi
ururimi
##kije
urugero
pi
##son
amagambo
bishobora
##yumweru
##yenda
guteza
2021
cyose
umutoza
ubusa
##mbaye
##tional
gitu
##soro
em
bashaka
##fungwa
bake
biro
umunyamakuru
##buze
kumva
##cye
ahandi
##rozi
ntacyo
ushobora
amafoto
ibikoresho
myiza
zabo
kureba
##hawe
##der
##kirwa
##biriye
your
des
nke
##kosa
##buto
##yine
##dy
##razi
amezi
rwan
muzi
##basha
inkunga
imiti
igitego
bitaro
##dura
bato
inyungu
##koresheje
##ranyije
ruhande
##veni
ntibi
##for
akomeza
##bert
yesu
sh
imaze
yate
##yaga
amara
umukuru
bivugwa
##bizi
##kani
##subira
itorero
##itswe
amatora
##lement
ngu
##lla
tanzania
##reje
##rekeza
##tonde
##ranyi
##giranye
bashobora
##hn
##ces
##ase
wor
iti
##tes
yasabye
##ked
bayi
inshingano
50
vuba
##rwaho
##byiri
##twi
inteko
mikino
tuba
##perative
##shinwa
##kisha
kuzi
maso
##yumva
##bayeho
bwana
qu
abafana
##siye
epfo
komisiyo
maga
##shyin
with
umutima
##herutse
isan
bun
ire
##itondo
you
27
rubavu
##aba
amaguru
sha
##cha
##pp
##zine
ruswa
john
##yita
##rereza
##buye
ashaka
ingo
museveni
##mewe
##nu
yita
kuta
bwabo
kayi
##rama
gicurasi
##shinjacyaha
##xt
##muka
bosco
byan
##sura
##shyushye
28
ibitego
##gra
kuki
kanama
##sira
##itozo
ebyiri
##shijwe
##uel
kire
nze
##garagaye
igitekerezo
zirimo
pla
##nde
kare
inshuti
umurimo
kwishyura
banki
##tte
imibereho
##shanya
##twaye
##korere
##shyingo
ibisi
andi
##senga
##yanya
ndirimbo
ziri
##ongera
ajya
##sera
abata
##yoboye
##zimana
hanyuma
uzi
##ons
she
cyorezo
imiyobo
ibanze
##risto
ishyaka
ingingo
nzego
##itero
##duye
hasi
ipe
##ol
pas
nyamara
##quire
##pho
##roshye
kamena
##ane
kuru
##itwe
cyongereza
icu
##komoka
ishize
ukwakira
##shed
##gurira
gace
##ruwa
##rie
politiki
make
bbc
kwica
rubuga
name
ubutabera
##shake
ushize
require
##jyaruguru
##jyepfo
burayi
miliyari
irushanwa
##tel
webs
guhera
sin
2015
yanyu
ibisigo
wanjye
mugi
save
akora
##rangiye
website
##heruka
##gendera
total
next
##kubi
##jwi
##hiriza
##gwi
mbi
wen
igikorwa
##rimana
ugushyingo
agomba
ple
##dow
zari
addre
##jijwe
##canyi
##ners
##ut
##seri
tru
##mya
bacu
mutwe
##yobya
##soma
##ron
##ph
##teri
##id
##hinduka
##cto
buge
par
##tribu
##itwara
brow
nari
##gabanya
amahanga
##gue
##sanzu
##yandiko
ibura
##hariye
##geye
musa
abafite
##ganwa
ubutaka
##baba
uda
##sumbuye
telef
address
mutu
rye
ashyushye
##swe
##ture
lea
ijoro
##tangwa
##manuel
bibazo
inzira
intebe
mwana
##subizo
nyakanga
##rimu
iy
##rita
irimo
urwo
zita
##itiye
##byara
kurya
makuru
mafaranga
docu
##kurikiran
ubuhinzi
kugu
##ziya
required
binyuze
les
itatu
haza
fili
##ct
ibimenyetso
kuzamu
##wita
##tandu
nzira
asaba
yavu
##vandi
##ball
##merewe
ingenzi
##rou
##kesha
nyu
##kwiriye
rd
##shimwe
fiel
##genewe
emmanuel
##gaga
baje
ntiya
##inota
##con
##bano
##cent
ahita
intambara
ihu
##kundana
##bire
ayi
bintu
muhanda
##rangiza
##lia
inshuro
gukorera
##tat
published
intera
nshuro
links
##rura
##shishi
enter
uni
##kini
amaraso
mana
arimo
##herereye
browser
##lin
push
guku
giti
bare
yacu
mugenzi
amado
##vandimwe
##tyo
marked
bagize
fields
##zeye
kenshi
##buza
##genza
document
##meje
umuriro
atanga
##shyirahamwe
window
umukinnyi
am
abasirikare
29
gukina
##ty
##rangije
please
itanu
byatumye
ah
##koro
umukozi
mugore
gasa
guhangana
##kandi
nabyo
wowe
muta
yamaze
iperereza
buda
rumwe
##jwa
stade
mashuri
##fitanye
##hinda
muganga
##cy
zimwe
yahawe
siporo
urubanza
##rwaye
urugo
umwuka
muha
##zuye
niwe
##tribute
dan
nyarwanda
amavubi
lu
##guti
huye
##zanyo
gisirikare
burundu
##goroba
umunyarwanda
ci
##girije
##ral
yawe
intego
##curuza
ibiganiro
umutungo
bugesera
##kuri
ubushakashatsi
##mije
##ranyambaga
##geraho
##mpa
batuye
##yobyabwenge
##toki
ibitekerezo
noneho
##huye
kaba
kiba
muhanga
##hagarariye
imu
bakoze
##kemura
nyina
ziba
mukobwa
aku
rib
lt
gitondo
##diri
##fashije
##shinjwa
##genzura
dia
gete
setat
##lementbyi
getelementbyi
setattribute
40
##fitiye
cyari
##rimba
hakaba
icyizere
##bije
por
sc
##sohoka
##zihi
waba
99i
##tanzwe
bibiri
##cal
31
##cial
##giwe
##depite
trump
##shima
##kiza
st
inyama
imbabazi
ea
umushinga
banners
ariyo
umuhungu
byabo
##gombaga
gutwara
##hagije
##minis
ubwoba
nyaru
kura
yana
chi
##kinira
##yeli
##shiman
magazine
##sse
bakiri
##shanyarazi
mfite
ben
itangazo
imbo
##biligi
hirya
nibyo
##shakanye
##onal
##shingwa
bwiza
##ubu
##nshi
wun
akamaro
##shishika
iteka
##kuye
##cwa
##rize
slo
##kane
umaze
vo
abakiri
##kwaho
mada
ishobora
yayo
##roko
##gena
##mvikana
ine
##mijwe
umusore
##ited
eric
ibita
##koreshe
imvura
##itter
##magara
##kubita
##hira
ukuntu
urupfu
nkoranyambaga
bigaragara
##vier
abahanzi
##kenshi
akana
##rengerazuba
##stin
abu
nyaga
ndwara
star
biru
runa
umubyeyi
rusi
turukiya
icyemezo
kuyobora
bin
yaho
##induka
bageze
yatu
ibin
##tic
babona
kira
##hiro
bifite
impa
bayobozi
impano
nyanza
##hitamo
ngingo
umuzi
##zanye
akenshi
yashyize
ukaba
bagira
kubaho
nzeri
ndu
##shyizwe
muza
##enge
##bonetse
kwakira
##yamamare
##huti
kugenda
##bimana
turere
##jyanama
amashanyarazi
##ritse
##muryango
imyitozo
##minisitiri
hino
ibiza
ubukwe
bwan
ubi
##boko
amba
batangiye
kiyo
##shyizweho
nt
##rugendo
two
imibare
kera
kwigisha
##yangombwa
sida
##moko
kuda
##deri
##rican
kiz
##red
##hugurwa
agera
##cco
uriya
##kiriye
bufaransa
##bangami
nige
gishinzwe
baku
ijana
##rwana
magambo
yatsinze
imyi
twari
twitter
mihigo
byara
abiri
tuka
##rom
ishinga
amashusho
sy
##shyigikira
kon
##sese
##shoramari
##ditswe
##lli
bwoko
bombi
##rwo
chan
bahawe
##hereye
##gabe
munota
ser
##kikije
ababa
##manza
ingendo
gereza
ute
##sengero
uwitwa
ubumuga
urugendo
ariwe
##mezo
was
amasomo
mahanga
umukunzi
##yamba
new
wungirije
##kerarugendo
azaba
##gurisha
kinini
runaka
##mama
umuturage
umuti
amasaha
nibura
##fatanyije
##yani
##ys
##tegan
batatu
gutsinda
##am
sita
##ction
##hinga
ziza
muda
##genze
##huje
##ther
bayo
buba
mirongo
iwabo
##kingo
##onga
##kiwe
ubushinjacyaha
gifite
##yonge
##sirazuba
##funga
##tari
bitanga
th
##kiro
bene
kub
uti
yumva
##hoho
butumwa
modoka
##bunga
##mokarasi
bindi
500
getelementbyid
mudugudu
##mure
ubuvu
clu
kari
mubi
##garutse
##hame
##gufi
kiyovu
##bonano
##sana
bagi
##zungu
kinya
raporo
inguzanyo
izaba
imbuto
batandukanye
yata
iminota
hashize
muhanzi
##pimo
intege
##com
tra
##zongera
pariki
asi
##lly
##muri
ai
komite
##shira
ubwoko
##shyiraho
ryi
abagize
alide
##muntu
abona
demokarasi
##wite
##tanyi
mpan
nanone
ubwenge
pier
ukwi
ugasanga
##mon
##shahara
##yubako
iburasirazuba
##furika
gito
amavuko
uzwi
kizito
##yemeza
matora
##frw
haki
naba
##ten
from
gutuma
ingufu
impanuka
ure
nshingwa
myinshi
guhabwa
gucu
ferwa
##tini
has
##rali
batanga
##kenewe
##op
abenshi
kugaragaza
tubi
can
##my
african
##kanwa
guhu
##ari
bice
abibu
mbuga
aramu
kurushaho
gicumbi
mpera
##guwe
gite
ibiyobyabwenge
kuya
##net
##ding
bakwiye
kwibuka
##kondo
umwanzuro
interna
##cika
ndayi
##gezweho
imyenda
##kundi
basa
res
##camanza
oli
ibijyanye
##rundi
ihe
yanjye
##ves
visi
##rego
nshingwabikorwa
##menyekana
gukura
##yobowe
abaminisitiri
ikomeye
##shimo
muto
vs
##rewe
##magana
hara
##nganya
bakoresha
nimu
##ence
ushaka
clau
##beshya
kwinjira
bwongereza
##curuzwa
##zin
ag
ukomeye
##sengi
mp
rusizi
wacu
##ura
bakuru
isuku
##ket
gusaba
intwaro
##liki
char
gutangira
##komeze
gusha
bigatuma
##kwirakwi
bon
##garagazwa
guhi
##tsinzwe
##fatiwe
##ster
##dia
zan
##gurwa
united
##banya
abaganga
umura
##hani
##mwu
isaha
##teza
##tewe
icyumweru
coun
abarimu
##yanga
##gati
##reze
bahise
35
gukorwa
koperative
pri
gasabo
one
amajyepfo
##ls
abapolisi
muhi
##teganyo
igaragaza
que
bura
prof
abagenzi
mbe
##line
##soza
##terwa
mwu
jose
cent
kwiba
##kangura
yatanze
atatu
ishyirahamwe
eu
bazaba
kugura
gikomeye
##gina
##itegura
mon
##yemeje
aziya
marie
##ndwi
have
ambasa
usa
abanyama
moto
##kari
##ring
##rushaho
igifu
pierre
mpuza
##twari
izamu
##od
##hagaze
##metero
bus
##shatu
##ciye
yatanga
est
##um
##ration
##mond
ubufatanye
rushanwa
ugere
mukura
##tsindi
kara
ubusanzwe
gene
##herero
rukiko
numva
ubwan
cyiciro
tuyi
##yin
bimu
miryango
bakunda
nanjye
##tre
##hwa
kintu
club
cyabo
hotel
##iteguye
yagaragaje
##puro
gice
nabwo
virusi
yandi
##shimye
che
agateganyo
##rasirazuba
##rengera
nyiri
abayi
rukundo
yabonye
ubun
##vuka
2014
##jemo
gisa
##raho
##yuka
umuziki
##ger
bakomeje
##tegeka
abibumbye
yako
##dukikije
iriya
##yabu
mazi
##cation
ikiganiro
##ditsi
##vugo
natwe
gitaramo
gukorana
umwuga
kili
umunani
inzoga
mbona
mini
##ngenge
##siyete
abadepite
ngabo
##ise
muke
##koreye
##korewe
##siti
ababi
##garika
wayo
##per
##use
##gaho
batari
uruhu
umubano
kanseri
##ganiriye
##kangurambaga
iharanira
bagabo
##rohe
kanya
abahinzi
##kono
##dini
bam
imitu
amajwi
musore
nibo
nigeria
umuhanda
##mbuka
mukan
bwose
byombi
international
##girira
kagari
cg
##vuza
igitabo
##tegereje
##koraga
yageze
##gukanye
amajyaruguru
wara
##itwarire
ina
ibinya
ukuvuga
batara
##ong
##menyesha
mw
papa
##ngiye
muba
bisanzwe
rubyiruko
bakinnyi
inganda
munyan
nshinga
mibi
yinji
zitu
kicu
reka
##rari
##gombye
yagiranye
yanditse
amakosa
amwe
mute
##pani
badu
ahanini
icyakora
##lari
internet
imibonano
kicukiro
who
##wandi
mugabane
##zaga
##ngura
yab
ibyamamare
##don
babonye
##mbyi
##bitsina
col
2013
##kurwa
wamu
##king
maro
agaragaza
##juje
##ruhu
ugomba
ngoma
##ziyo
cumi
kiriya
##lop
##vamo
##shyikiri
##yura
wabaye
##gram
masezerano
##itangaza
babu
##sinda
telefoni
kuzamura
abarwayi
tran
ut
ahitwa
##ua
##lisa
##tangiriro
##siya
##mvise
byabaye
meza
bitwa
##kize
mateka
ruri
##ciwe
##koko
##ed
sou
##komere
yuba
ubw
kubura
banyarwanda
portu
mpa
##latini
##dent
igitsina
abanza
198
igifungo
mpuzabitsina
32
##myi
gusi
##vugaga
yafashe
##shyigikiye
bar
ryari
ruda
ibitabo
60
ibyiza
##tungo
##hanu
byu
fpr
##hoza
ibyishimo
kongo
imikorere
##rengane
barenga
mubiri
soma
kugaragara
##banyi
aribo
##suye
ve
rushya
sacco
filime
##viziyo
##keye
their
butaka
##nuko
magana
ubworozi
ubwe
hata
kiliziya
##pfuka
icumi
##liya
##dwi
uruganda
gukumira
##sobanuye
bufatanye
ukora
##tsindwa
nyagatare
guca
uturere
ruza
guhura
olivier
##byaye
inkotanyi
##gukana
usi
butegetsi
uzaba
impinduka
abatuye
muru
mama
##zeyimana
##ssa
mategeko
igira
##ree
bavuze
##hembwa
twu
##rukana
##gengo
bushinwa
bibi
##ctor
ibice
sport
asanzwe
##ganire
##kingi
##tinya
bane
izuba
bagore
##as
interahamwe
gutegura
ngoro
##nc
bandi
##shimishije
usanzwe
##tsinzi
##nziza
riri
gifaransa
##guzi
##gamizi
##sena
ferwafa
whi
##rekeye
##merera
gukurikirana
yayi
##ok
##butsa
agu
league
mutima
amabuye
nteko
##menyekanye
##rerwa
##gega
taliki
##eu
##kimbi
bifuza
claude
inyandiko
##yuze
ange
muzika
biteganyijwe
kuga
abahanga
ibyangombwa
kivu
akagari
##kure
igera
rutonde
his
yongeye
gita
ubona
per
pen
ahari
##gane
##genzacyaha
niko
zifite
atangira
baru
byaha
nyarugenge
zite
basanzwe
##shinze
inye
ibidukikije
imiyoborere
kuha
##mereye
##sis
##tani
tugomba
deve
impungenge
##tware
##port
abakora
##lamu
diamond
urubuga
guma
mara
gatu
##hingwa
ijwi
abikorera
ima
##rero
##kimbirane
##yite
##chi
##tira
caf
karu
rura
komini
ireme
uki
##iterere
45
##mar
twese
niyon
sina
bwari
giturukiya
kamo
muyobozi
ibihano
min
atara
pour
part
##rick
bumva
##muna
abakunzi
igiye
ruhango
##phone
sosiyete
##ny
rufite
##sobanuro
slova
##mpu
guhindura
bikwiye
imishinga
##sed
##gihugu
##giriye
vide
##zanya
eshatu
##tangajwe
asanga
##tsiko
##bandi
mirimo
imisoro
op
bab
bako
##shini
kumi
bariya
all
amasoko
bimeze
##muha
63
ibiciro
el
basaba
yise
televiziyo
ake
imyan
fu
##tandukana
##shimangira
amata
cyiza
padiri
##rijwe
##gora
##gejeje
abakuru
##shishikariza
uwari
##res
mala
air
##hangayi
##nya
##haranira
zikomeye
##teli
abacuruzi
makipe
mushya
##koreshejwe
sho
##ques
kilatini
##kunzwe
tuga
va
ntibya
##rokotse
bakozi
##tangaza
bwinshi
##vuzwe
rivuga
atandukanye
gra
rubanda
hon
wenda
kurinda
##baga
rugamba
##jura
bizaba
##kandida
##20
##phe
jye
said
300
kugabanya
kunywa
gushyiraho
abasi
##tyoza
yemeje
igitaramo
##eza
ikinyarwanda
habya
##hwe
##mas
amasa
bivuze
##shyirwaho
##bwoba
buza
07
##gisho
intyoza
icye
##tana
##neza
urutonde
avuye
bazajya
nkurunziza
##ff
kirekire
bahabwa
madamu
##vana
##fashisha
une
bakomeye
akiri
pat
##cia
zombi
up
joseph
kubana
##yamamaza
ukomoka
bas
kigero
intwari
##ngire
bakobwa
cyaha
uhagarariye
##vutse
##ner
##ngira
rushyashya
intumwa
bike
biganiro
kwandika
batangira
igitu
nshingano
##hutu
kudu
riza
tuzi
##fungura
##shakaga
##ineza
yifuza
develop
baya
ubufasha
##bonera
her
ibiribwa
##19
36
gukemura
guhagarika
inno
munini
ami
itandukanye
inc
abasore
kubo
gakondo
ibitaro
##sabimana
hagamijwe
kuburyo
##peri
kutu
baturutse
##funzwe
kubunga
ugiye
zida
##itabira
trans
gishize
##vuguru
##dani
##guze
uvuga
##kangurira
kampa
##ddy
##gereza
zira
dukesha
##gereye
grou
##gishwa
##shumba
##yumvire
##gita
##goye
##itana
kayumba
bitatu
ikarita
ibicuruzwa
##munwa
ihuriro
uburayi
habyarimana
04
##kuwe
##geni
fd
ageze
bugufi
##shakira
##kinnye
ishyamba
2012
##rima
muhabura
nara
misi
##cis
##size
asa
byeme
amadolari
##bin
bakorera
yabanje
bakabi
ibanga
ale
##ganjemo
##bwire
##kurikiza
byiciro
ndan
ubushake
rira
##vers
##riweho
imiyoboro
karo
##huri
busa
data
uburwayi
##ad
##jyaga
##gitu
kum
bakajya
##hinde
bubiligi
##banuka
bisaba
abahungu
##banye
gufatwa
buka
yisumbuye
intambwe
kubahiriza
bwite
hakiri
99u
kikaba
##zihiza
##vin
##yweho
##horaho
##ght
yemeza
##garagaro
iran
hato
##yira
fil
imitwe
##suzuma
##gaze
amoko
##med
world
kubungabunga
##kol
ibiti
wose
##nan
abanyamuryango
ijuru
basanga
gupfa
##zara
bimaze
##hisha
33
abamu
robert
imyitwarire
##rk
##caro
imitungo
metero
mushinga
##gezi
##hungabanya
##huriye
ugereranyije
bahanzi
impunzi
tuta
idini
bavuye
ubugenzacyaha
rishinzwe
masaha
baramu
##yire
##panyi
manda
##yapani
bishwe
##gerageje
impe
bashya
ay
rwamagana
##gezaho
munyaka
##kurikije
ubuvuzi
##jyambere
mabwiriza
they
ethi
koro
##gy
##hagari
abanye
app
kida
gufungwa
##zamuka
##min
aribyo
iterabwoba
uyobora
akaza
umushahara
##rwaga
##50
muhango
adj
agi
196
##enga
##zeza
ntaho
wahoze
##deli
##duka
ruse
##tho
##garagu
zika
ngi
##mve
gutangaza
yasoho
iman
##shema
##yoboke
##cide
##garagam
niho
##opi
##hombo
igihembo
mike
##funze
34
##injiza
##rondo
buvuga
reba
bagaragaza
##bukuru
##hesha
isira
##shyizeho
gitabo
kamonyi
##alth
##jyanwa
chris
##shiki
abaza
pho
ububanyi
guto
##kwirakwira
umurongo
##fatanyabikorwa
gusoma
##jugu
##rm
bigira
val
70
##hili
guhuza
hare
##hindutse
kuwu
##gezwa
inkiko
mwene
igisubizo
amazu
bumwe
ubwicanyi
##hizamu
abwira
##rwara
##mic
##fura
##yubahiro
##ariko
yatangi
akarengane
twara
##pfukamunwa
il
##shimisha
dis
gusura
francis
##itangaje
##ley
##kubahwa
iru
mr
##mber
amahugurwa
##ranire
kampala
guse
tumu
bizimana
rnc
##land
##lles
##butso
bisa
##rekezo
ngufu
##tere
maku
itari
##xi
##gerageza
kwizera
ethiopi
ava
myanya
##daga
tour
197
itike
car
inyuguti
patrick
face
yafashwe
shyaka
##rekanye
##pima
imyanya
##rebe
##garama
yuko
peop
##rwamo
##int
##rebana
abate
theo
##comment
##und
kuganira
city
camero
usibye
ntigaragazwa
getelementbyidcomment
kwitabira
##nko
cyarabu
##sohora
but
dani
yadu
imiterere
yigeze
run
##mani
amase
nto
##tra
##mer
nyakubahwa
akomeye
kayon
##bel
cyacu
abakoresha
##itabiriye
##bonaga
##kuramo
##hande
2010
ikorera
ishimwe
ikirere
servi
ivan
agace
##nes
hakizimana
isango
##guruka
ubwu
mudaso
byamu
nyamu
kwandura
cap
##tun
##fuzo
rubanza
yavuye
##shyiki
sur
nsengi
##hamaga
muvu
yahaye
mbese
ingengo
ubukangurambaga
##bunda
ibaruwa
nge
amakimbirane
pasiteri
##hishe
utara
muli
inyamaswa
ps
##sabagina
people
akajya
agahinda
munye
rutahizamu
team
##wer
##duko
imihanda
murongo
bavu
gusu
azajya
kinyarwanda
bat
umukono
bigaragaza
ikora
ber
inzara
08
van
yabu
champi
rusesabagina
00
kose
kindi
##itani
utaha
mugaragaro
bito
imbogamizi
maj
icyongereza
##gamo
ibyago
birori
2011
bafata
icyiciro
bakunze
ibyemezo
akunda
den
##hirizwa
umwarimu
ibirori
nga
mudasobwa
km
##riri
burya
mart
muti
##shuli
250
development
##turutse
bigeze
##mbitse
tho
guseze
amaga
ariho
tukaba
kimi
fin
kwiyongera
38
##stra
##mpaka
yapfuye
##citse
##feri
##situ
inyi
ingabire
ziga
misiri
aru
##pamyabu
yashimiye
##ee
##hanganye
90
kubaha
##cumbi
ikoreshwa
bitabiriye
##yoma
utuye
##ments
isano
tugiye
nyungu
video
ruganda
icy
ubucu
akamu
ubura
##tangiza
cal
wumva
isezerano
ubukene
##geyeho
##simbu
interine
yare
ahagaragara
##fashishwa
gukunda
gatera
##kwirakwiza
mezi
dans
edu
nyandiko
national
lan
##uld
akan
##rikana
mugabe
ubwami
##bari
##bibi
igihano
##mpinga
ntawe
cana
bitari
kirehe
##sangan
aherutse
##yahu
ibisubizo
basket
2000
##kurikiranwa
petero
banya
aravuga
ambasaderi
##zindu
karongi
##ac
us
isanzwe
##mbaza
##gali
maroc
habaho
zu
ngaruka
remezo
ububasha
jeanne
##zura
ruha
abavandimwe
##ses
ubukerarugendo
##gendan
isirayeli
interineti
imyu
ntago
##shyurwa
sena
wenyine
##rengeje
yagombaga
nki
kirimo
##neze
##tunga
gate
ibizamini
patri
##rindwi
##yezu
intoki
##prc
ap
iko
uyi
##biriwe
nyampinga
ahagana
bagenda
##ruru
impamyabu
rugendo
##ef
charles
##bwaho
##herezwa
milli
ibihembo
er
indan
igita
ifu
##rekeje
ii
gut
amatungo
zikaba
##mbanyi
kristo
ifoto
ntangiriro
basanze
umugambi
habaye
utari
##kere
fan
spe
dire
telefone
##kemu
ishoramari
bamenye
##shidi
busanzwe
ruku
ikiza
##renza
##gaba
ikirenga
##fashishijwe
##senya
##merika
##ganywa
wundi
##kanisha
baho
umusanzu
ikizere
##sheke
twaba
iprc
bushya
ndaba
ubwiza
kwivuza
tumaze
igitero
jya
##wabo
ise
amarushanwa
agenda
##rit
nako
james
abamaze
##mire
##misha
##ded
##inyujije
##urs
kompanyi
cip
nyamira
##30
bakana
ubuda
##inyuguti
qui
kayonza
ste
cyumba
##rema
ubuhanga
abashinzwe
produ
mugoroba
gusubira
rwaga
alex
jac
##garura
ishinzwe
##ber
##giraho
rurimi
vin
remera
##mbira
##jan
marushanwa
##gal
wine
umunye
batanu
igiti
##ziran
##hen
akavuga
mwan
rundi
##now
##ganza
nicyo
igizwe
##fashishije
##tekereza
rwabo
minister
bigize
icyu
37
bagu
bushakashatsi
yize
##nyeri
telephone
iku
igomba
##hitana
##huse
##cer
##komo
than
yica
king
yagarutse
##guro
gutekereza
don
pano
yaku
itegekon
munyakazi
awa
pan
##bola
##tungu
##mbia
##gezeho
bakaza
##refe
uha
##zamutse
##yubaka
majyaruguru
ane
reg
yabereye
atandatu
gatolika
##bikora
##sangira
##rineri
miti
yatumye
yanditswe
##fatika
##biziga
group
cup
##tegetse
ahe
##ship
##fashwa
##cyari
which
nyubako
##geko
ruga
nsabimana
ndege
akwiye
mushiki
panorama
kwitwara
innocent
rdc
ou
##bitekerezo
##ziba
hate
kwambara
igamije
ind
myu
para
##cyu
umucamanza
##ranwa
bica
##gerwaho
##ranyo
##hagarika
##buri
samu
41
insta
##rity
ibitero
irindwi
##taka
##jima
bwawe
ahabwa
kuno
ikomeje
##raba
##sora
general
regi
offi
ver
##kongo
mugihe
nyamirambo
nzo
##kwan
ukuriki
##motari
mugisha
imbunda
kubaza
isonga
ji
##lis
kimaze
##gongo
##kenera
rwari
kumwi
##manaho
urugamba
yanga
ikosa
sun
##lr
##itangira
imyanzuro
burasirazuba
##ruye
umudugudu
karangwa
ebola
zishobora
##senal
ubanza
yongeyeho
musaza
baravuga
##rent
amavuta
##hanuzi
yaka
kirere
men
abazi
##vanga
abagera
basketball
01
imyumvire
cho
urwi
ihoho
mbo
turimo
arsenal
kinyamakuru
##ving
igisirikare
##tsibo
bri
ndo
isra
##ziranenge
##shyire
##itiro
##forma
##88
##shoferi
##zuza
##onald
murakoze
##gb
mukinnyi
##zabu
##date
##ranze
gori
42
gushyigikira
##kwigendera
639
ethiopia
##gn
##mina
##muriza
yunze
cn
##iro
##lie
##mbera
rca
har
bakamu
##cess
kiciro
gitsina
buriya
##shanu
##ot
##des
urwanda
##kristo
muco
##vaho
imipaka
thu
bina
bakeneye
##soje
##las
ltd
biriya
reb
##lometero
##politi
afata
##bangamira
yambaye
##rukanwa
bihumbi
bishoboka
kabu
butare
ntera
confe
mirenge
presi
kore
buyobozi
##aniwe
##rusiya
jan
nini
imvu
##spe
arabi
bahita
##toni
day
canada
##cien
##rega
yasin
##limu
##ffe
scho
ibyumweru
organi
kama
##nzwe
##ristu
##babaje
eshanu
umusi
##rekezi
icyenda
abahutu
buhinzi
masa
mali
##shanga
byagenze
bobi
also
nyakwigendera
##byina
gover
##mit
sup
our
zinyu
yabaga
cyaba
##koranire
gatsibo
##ssion
instagram
itegekongenga
sudani
##gihe
zayo
gukoreshwa
mat
hantu
dieu
##cyi
kabi
##zengu
iburengerazuba
##pool
more
ren
##tinze
##ngwe
ikimenyetso
njyewe
inyubako
##shanyo
vita
wabi
zigera
##sia
##sesengura
chu
liver
##piteni
yatangarije
##book
gikombe
##tinda
bafashwe
##rds
##kenke
ntego
abanyamahanga
butandukanye
igiciro
##kuraho
##genzuzi
itumanaho
nshimi
sp
bakoresheje
ubuziranenge
biha
rep
bru
##yeri
2009
##beshye
rita
##kanda
mubu
##kindi
daniel
mani
nshuti
##kia
bukungu
kato
know
##hurira
vincent
##mategeko
biterwa
frank
its
bakomeza
yato
yahi
abada
ukuriye
03
##ins
##mukira
##yunge
ikamba
kamwe
toni
hifashishijwe
icyayi
minist
impapuro
##koma
abaha
##garariye
gushakisha
ashinjwa
400
ikwirakwira
sofi
rite
kugenzura
bagaragaje
kano
ntambara
liverpool
##yisi
gufunga
mitu
nyine
fdlr
gusin
##kurikiranyweho
nin
abone
mwarimu
ubure
##lix
paris
##rwanyi
facebook
ivu
ituma
aribwo
##giraga
far
stan
##byaro
bucuruzi
##byini
isura
imanza
nyabi
babaga
abaturanyi
mupira
nizeyimana
##ranywa
##merere
##raniye
univers
##sp
rushinzwe
##dufasha
umugabane
09
what
kugaruka
bakavuga
##hangayiki
##gne
banjye
##mererwa
gutaha
2008
##gariro
54
##kw
banyeshuri
inzobere
##byino
##liyani
yegukanye
guverineri
bank
##rise
women
mine
##mwo
##sengesho
rikomeye
##up
majyepfo
ed
##nganira
niyonzima
39
bize
ubutu
imashini
##poir
##stitu
umuhango
bukomeye
batazi
ingagi
binyuranye
##yuranye
##cul
bemeza
cor
##weho
fami
cyenda
basaga
gushyirwa
48
igena
##ranisha
##yange
##enne
##miwe
##subije
inge
ibisabwa
##rabuzima
##girana
gufatanya
gre
##cs
kubanza
namwe
##cono
06
gise
ugira
yagu
ruguru
avu
##gishije
virus
##nezero
##bazwa
##tuye
ango
cyemezo
albu
bwanjye
yavugaga
umwanditsi
guhe
ihazabu
abakiriya
##rinde
bigomba
##keka
kt
##hanganira
gisagara
##ars
##ruta
kwerekana
##ters
##chard
bafashe
##ranije
yakiriye
nazo
##beho
basi
amadini
##bite
gusubiza
ikira
espoir
##zamura
icyubahiro
syste
nona
mug
##guke
##ders
coo
##baka
ruhu
ngiye
nkaba
kurengera
akabi
##tegereza
##sobanukirwa
yindi
##tsindiye
school
##rinzi
ubwandu
rwabu
##mogi
ingano
best
bra
intsinzi
##mirimo
##cel
##shyitsi
##rate
kapiteni
##sirayeli
kabera
umugisha
tegeko
##shingizi
##wn
##fuzi
##ux
ubuhamya
##shyiramo
araba
kwitegura
##hamagara
##migambi
kwite
##yahudi
koreya
shi
##banire
ubwiyunge
atanu
cen
yahu
martin
##yongere
amako
richard
diane
##diyo
nimero
urukingo
munya
seru
##injiye
real
meya
umuce
##jeje
stu
nderabuzima
hamaze
##led
##ung
itara
patrio
miche
##shyuhe
imirenge
ryita
imyamba
##ntu
yemeye
##dri
incu
##renzi
##rizo
iwe
##tanira
tom
akanama
munyaneza
##ruhuko
##ace
##soni
prin
bikoresho
urimo
bafitanye
yerekana
##zwaga
kitari
ik
pr
##tor
inclu
##munsi
nyungwe
nyaka
##hh
ubushinwa
ingenga
kurangiza
ibye
kwiyamamaza
44
##ges
nonaha
tanzaniya
budage
##mpe
hoteli
sibo
##meka
christi
ak
##vugwaho
wasanga
mashusho
##shuti
atuye
ibisa
ntiha
inyeshyamba
##bri
impande
abayoboke
##pas
##boneye
ngamba
umurambo
album
econo
##butse
##mbika
badafite
##mutima
##garagambyo
ngira
az
contin
##mamaza
sahara
buga
##vugaho
##two
##fate
imibiri
##sinzi
champions
nacyo
gutandukana
govern
bigenda
##fungurwa
myugariro
##hinduye
##gatifu
israel
##shoboraga
kunoza
##ringanire
##shidikanya
##ganyije
gusenga
amaboko
##fari
kitwa
bakundana
dukora
abategetsi
kivuga
shuri
##heli
nyafurika
##ek
umupaka
urumva
##gure
##h00
bahe
##ngani
yaguye
tuni
##rien
##wandiko
##sipan
##garije
##ngwa
bubi
igeze
##gema
##bora
ubutwari
south
##masa
##sion
ikiri
##fuje
health
##mbano
##bashije
##tura
##shakisha
yemera
batanze
##sobanurira
rdb
##ngeye
##raniro
rifite
musi
kumara
##kon
amaka
##try
abami
waje
kubyara
##birwa
##moso
umwenda
##mburwa
rusengero
bahi
##guma
yaseze
kuririmba
##manzi
bibaye
kumenye
nyamasheke
99a
##dukunda
gusubi
aro
bigamije
david
umugoroba
kwemera
ujya
bakorana
nye
ukunda
##pen
##hangano
gukome
##gurura
kubwira
amatwi
buke
ibiryo
zindi
muga
yatanzwe
##teguwe
##hite
##mbire
tanga
##kurura
nkunda
ingoma
samuel
myi
hagiye
yigisha
##yongereye
wita
02
babanje
##habu
wabereye
nyabu
##byaza
asobanura
twabi
##kundaga
imigabane
umunyeshuri
angola
##bajije
nibi
zibi
centre
46
mbu
##mpi
##duha
angana
##runga
##baha
bufite
paruwa
##baje
##mbaro
##hamye
gaso
izwi
##mbanya
##bangamiye
##kiran
murimo
peace
nyamagabe
parti
guhanga
##tiwe
##llo
##hia
##funguro
52
##ziti
##raribonye
zinyuranye
urwa
gushyin
##illa
flo
son
##tant
rwiyemeza
tshi
##dari
informa
##shaje
ibishoboka
social
sitasiyo
aganira
##beti
kuboneka
##sure
##widi
kigizwe
mupaka
kubyi
tech
ubwabo
##kristu
kuku
nkiko
##gua
ubufaransa
##shejwe
amen
##giteri
##hereje
maboko
politike
##kinisha
bivuga
eng
dosi
bise
yasa
konge
##mbabwe
##iness
##bantu
##subiye
tsinda
##ns
asaga
mt
umujyanama
lou
##baho
matsinda
##perezida
umuceri
bakina
##miye
##guza
##kundwa
##sun
banduye
imbwa
##ganisha
kuguma
gutyo
##shop
mukaka
ishyirwa
zacu
mwiherero
igenamigambi
##ft
bine
##tro
hakoreshejwe
atazi
##kurikiye
yavutse
ntitu
donald
nubu
##itangazamakuru
ishusho
##ant
abare
mbabazi
##bani
##kode
##kuzi
were
aje
bur
##gwiro
ibinyamakuru
zara
##yoro
##bika
kavu
ten
##11
##byaha
heza
aca
##hiye
sala
oms
##moni
umuvuduko
agri
imyuga
plan
ndabona
##sti
hazaba
depite
magu
mwuga
republi
urumogi
nshimiyimana
kanada
##gagaciro
university
akanya
imbuga
imikoranire
beza
poro
christian
inya
nyaruguru
ibyuma
ikinya
##hariwe
cp
mari
##rand
imizi
akoresha
mukaba
ubushyuhe
zirenga
agamije
geor
amanywa
##cor
##rique
abati
99aba
jacques
habayeho
other
banga
abafatanyabikorwa
##hondo
igifaransa
yanze
bidasanzwe
kabuga
rwiyemezamirimo
##garara
muturage
chief
ryan
cyara
secon
##huta
country
munani
##hisemo
hegita
kibi
rikaba
paruwasi
nsan
##saza
kamere
bava
zimbabwe
kwegukana
afrika
uhereye
yakozwe
mashya
bwu
yiga
yishwe
##aa
##hembe
47
##yemera
file
##ance
urubyaro
bahuye
##songa
yashyizeho
rgb
##die
##ston
education
##guta
##hirwa
una
christo
##jana
##teur
kwemeza
##lley
phi
ibibi
eva
ishema
9d
isaba
##rst
##kuko
##sekedi
base
kika
byayo
##kubise
##funguye
kohereza
##shingira
ryose
yakwi
kdi
akoresheje
##hakana
yakoraga
bibu
azwi
bap
kwicwa
murwa
rutanga
rev
yezu
##shon
gishobora
##sohotse
##dagadu
##ije
##len
ikigega
##negihugu
ntiyi
year
##nyine
guhinga
##stine
dosiye
##ach
habonetse
yewe
ubwonko
gutunganya
gakenke
ter
mal
mihanda
out
tubona
impamyabumenyi
oba
bwayo
president
ike
##ition
amubwira
artic
ishaka
umuhanga
twifuza
baran
abarenga
years
##kuza
##ringiro
sco
##gurika
##yongeraho
oya
ino
bizi
##shimu
yerekeza
ubwongereza
##ramutse
yateye
rukomeye
000frw
ankara
augu
kubikora
amagare
##kekwaho
gucunga
bajye
perefe
600
##ard
##ocide
made
##linda
patriots
##myabiri
yinjiye
##taha
chri
urebye
uwama
##erry
##fatira
##riritse
bigi
zaba
bahuriye
akoze
##rukan
umupolisi
##hanwa
##chester
photo
ihohoterwa
rwandan
##garagariza
195
ahani
##karaba
##ens
75
##sheho
##her
konti
##gitura
2003
cameroun
##cungire
filimi
thumb
##gande
bitanu
volley
##cted
airtel
makumyabiri
##lf
amajyambere
amb
##yane
gera
98
ibinyabiziga
yves
kur
bawe
yohana
bute
##shyiriweho
indimi
bahura
abanduye
tshisekedi
bafun
euro
##uri
gukin
mwinshi
##munara
##shingiwe
##cisha
urwan
##tina
##hitanye
yamenye
promo
impuguke
##holan
ruka
abavuga
sadate
##ranyijwe
butu
abicanyi
##tangije
saint
enye
gutangiza
##guha
uburasirazuba
ibitaramo
manzi
##rc
house
guhungabanya
mahoro
##chael
ndayishimiye
##bure
hab
##kangu
when
##myo
##rusa
kuvura
abatoza
gasogi
arenga
mubyeyi
byakozwe
hariya
##jora
##mamaye
uwu
##rarwanda
byatangajwe
ruzi
##mbiye
mpande
ntimu
##pon
guhora
##simbura
##rson
iradukunda
rba
##itsin
muziki
##pf
##ries
##ney
##gayi
kibu
bwacu
194
muhire
iherereye
kubafasha
christophe
##cira
manchester
##zinduko
haka
rute
##tsiro
abaki
akagera
##yoboraga
kuzamuka
##banutse
##kumi
hakuriki
ruke
ryabo
nyobozi
53
akorera
glo
umurwayi
burezi
##win
bakomoka
##ngeri
inkoko
been
isabukuru
iwacu
##px
##generwa
nkera
##buzima
amaba
##celles
##dagaduro
kizaba
sibomana
loni
##giri
ingengabitekerezo
guhana
east
##din
bimenyetso
nyamwa
won
gucika
haje
##bukije
yaravuze
them
gitifu
##burira
gufungura
##dera
cyamunara
hegitari
800
ivo
ibyabaye
bawu
rusa
imirire
guharanira
##silamu
##shisho
ndumva
mpanuka
babyi
##yoboro
shin
rishya
##ille
##kubiye
##rabura
##byemera
isomo
##gonda
kamu
ibigori
##tus
mibereho
tou
dja
basabye
##onjora
atangaza
##rence
ukwiye
abisirayeli
equ
kabo
dushobora
irenga
abayahudi
##gufasha
##zon
first
ahanishwa
iji
nzaba
vc
america
wigeze
##fatirwa
mukakarangwa
umuta
rutsiro
br
mafoto
ikirego
isoni
fore
ifatwa
wakoze
imyambaro
05
hatangi
sudan
ajyanye
##cts
yasobanuye
intama
ndanga
##plo
##tube
burera
goma
gisenyi
nyamwasa
bambaye
business
uwan
##tincelles
basigaye
ndende
article
##inea
##politiki
fred
##kuze
kimenyi
ukorera
##yanja
rt
ukiri
##sabira
##dege
##mburo
##zambi
##car
ujye
##vest
##fuka
ayobora
namu
##remye
babe
akaya
commun
gusiga
biden
##himba
media
uburinganire
kuvugana
itandatu
##kishwa
gusuzuma
intanga
##vuge
proje
##cen
##hagarara
ele
##kereje
guhinduka
##sobe
##lemu
bashinzwe
ingana
hana
ishingiye
gutora
institu
nabonye
51
imbyino
aricyo
bapfuye
ibyumba
ikibuga
##kurikiraho
dro
##padiri
dawidi
guterwa
##koloni
abanyafurika
gitero
batandatu
biteguye
gor
##huka
##less
ubuhu
##garitse
##lbert
##koni
birashoboka
yatewe
sil
yashize
umuvandimwe
abafaransa
##lon
##shushanyo
##bwiraga
yiba
gorilla
##mbwira
##rebwa
basabwa
riba
adu
yitabye
##gogo
ibisobanuro
kuzana
mose
##taba
uwe
##kurikirwa
##kurya
throu
yahoze
ifasha
##cra
kumvikana
izajya
abashaka
moro
bigera
##oney
1000
bla
uwahoze
##mungu
##kunde
theogene
##gereje
##ning
yishimiye
iyobowe
##yiko
##yoborwa
bigoye
##lica
yakoresheje
manager
tuyisenge
etincelles
ameze
manota
uvuye
kwizihiza
ambasade
babone
colle
##swahili
abarwanyi
mazu
yuzuye
eve
##mbya
mugu
there
kuruta
ibikombe
munyarwanda
volleyball
babaye
umuganga
##tanya
##ling
##yobwa
birebana
##byu
noheli
banyu
basore
##buke
##subu
commi
sinzi
byatuma
michael
eac
##himana
##hutira
##rp
##dindi
indu
##cece
##pany
43
dj
bamwi
##mejwe
imbibi
yasohoye
##bindi
##hitan
kuti
bishop
tuki
##cie
million
yahuye
##ities
yatwaye
yakoreye
##kubiyemo
##kundiro
##roheje
yazi
burusiya
mashami
abarokotse
misozi
##yamamariza
genocide
rwandair
nyakuri
yatawe
abura
gukubita
ndagi
biturutse
##at
##kubiri
ibipimo
nkaho
##shyuye
inkoni
igenda
##10
babyeyi
##gango
##mvu
umugi
ibihu
magufu
gutsindwa
ubuvugizi
mitwe
thierry
penal
use
##hing
##mbuzi
yongera
uherutse
gro
##tegura
##pre
##bal
##zure
state
##duza
##tta
bashakanye
byatangiye
sto
pawu
##kabaye
buhinde
dusa
mwashakanye
##gendeye
ng
##times
bushobozi
mozambi
plat
##val
mishinga
buhoro
kurenga
rure
55
kugwa
##kweto
##pfobya
##mwuga
##ctive
bizatuma
youth
nsengiyumva
kuvugwa
ibyan
nyir
if
abashoramari
imvugo
some
zahabu
##lation
##stru
inkomoko
##girika
##sani
zimaze
guka
kilometero
##fatiye
ubusabe
yafatiwe
ubwishingizi
##butumwa
##jimana
2005
##bozo
abarundi
berna
cer
biteye
cri
##diko
ghana
uzamu
umucuruzi
rukaba
##lus
##lp
##gama
babana
##biya
cyabaye
ntawu
masomo
yaga
inyigisho
##mwita
150
josi
##kaye
65
rwamu
##komeretsa
gucuruza
bishingiye
urw
##df
##yejana
yihariye
through
##gozi
kayita
biki
##henze
kwibaza
icyerekezo
ijisho
guho
bihagije
##sso
##sitani
##rejwe
ikomeza
##and
gukira
##ker
mate
##ganijwe
##cana
amatsinda
##dina
abajijwe
##tiste
andre
ifata
##lg
yakinnye
##shimana
aze
##vugana
franco
anasta
##shyikirizwa
runini
urwibutso
over
karindwi
victo
mujye
##yehova
yaran
##gororwa
idasanzwe
##boka
wasa
ibitu
##bwirwa
sam
awu
guinea
##hemu
##vise
rishingiye
pasi
muvunyi
##cho
gushinga
karekezi
youtube
##ng
abazungu
tugize
juru
ibe
sofia
musozi
##cibwa
yego
super
alfa
68
uk
##byumva
company
habimana
byagiye
imitima
government
ger
igihombo
njya
bukaba
bifasha
ntiwa
##sanzure
abashakanye
system
rukuru
imihango
hazaza
##holandi
pawulo
mucyo
##byaranye
##dite
##tain
nor
##herejwe
1990
stanley
mina
umukandida
##itera
##liza
imyidagaduro
##sanya
barabi
josiane
##shing
miri
kwigira
udushya
##tar
##ou
##tego
duce
ibinyoma
barcel
##cti
mac
##furiza
##jyanywe
mukamu
umunyezamu
kurwara
baganiriye
##gome
##herezo
burengerazuba
habu
notes
ntawa
cyitwa
kurwana
bishya
bikunze
zin
##mezwa
niyi
##fashijwe
##tries
yabitangaje
intare
marine
ryitwa
nyiran
times
nkunga
umushinjacyaha
countries
##shyikiriza
agricul
yiteguye
gusanga
icyari
##mbana
ph
byoroshye
ibyiciro
49
gutoza
##ires
high
##drid
ajye
ly
##komereza
jules
sma
bwakozwe
##vuyemo
egi
##sabaga
tha
magufuli
gukwirakwiza
##cunga
##viramo
abaturarwanda
bitera
bagakora
rwiza
##rangamutima
akimara
##riba
inyo
##kennye
ayoboye
njyanama
had
mtn
imisozi
mukunzi
umusirikare
sugira
tangazo
alfabeti
uburengerazuba
ani
human
##hungabana
##rusalemu
free
rene
ven
turaba
bikaza
##herukaga
abakirisitu
yashyizweho
nkambi
##lande
inkingo
##diya
##rankunga
byaje
peter
yagaragaye
iriho
yashakaga
guhita
ariya
##manuka
fau
##lindo
ob
yabuze
haruguru
aturuka
erne
##zaho
bigiye
fifa
kinsha
union
##zanira
2006
##roka
gukaraba
##dis
zambia
##logy
services
comp
##fatanije
##hugura
zisaga
rika
itabi
yerusalemu
albert
ave
torero
nyaba
kwagura
yagera
bibaza
##lity
##deration
madrid
myitozo
57
##bahi
##itekerere
isuzu
##miya
kuzaba
kay
rulindo
secu
amadorali
anto
ubuntu
ntaki
mane
ibara
bak
##cakubiri
##gereranya
abdu
##dine
##rukira
buvu
yagizwe
ibitangaza
yandikiye
yama
nijoro
musenyeri
inzozi
ijya
##mutse
##anirwa
##mvira
gakomeye
imboga
##zenguruka
##boneza
france
uwimana
ivoire
edo
slovakia
sunrise
gaciro
gasana
juli
urwango
kinshasa
fon
wuba
##sea
bundi
ibicu
##lar
program
center
akomeje
amafi
##tsweho
##rwano
irya
##ciriritse
abanyamerika
##kubwira
navuga
pl
##onel
bwicanyi
mahirwe
kabila
kunye
##semburo
dushaka
##singa
twebwe
biti
##ppe
kugirana
kanombe
ken
bishimiye
watangiye
kitarenze
kureka
yajyaga
amashyamba
##ghts
masoko
sitade
public
gusohora
mahugurwa
##gendana
agapfukamunwa
radiyo
life
ibira
##ngero
ikiciro
ataza
atangazwa
zina
bible
##mvikanye
99ubu
bunyu
tuda
tuzaba
##mirwa
prote
habineza
money
yahisemo
##mwaka
post
ndagijimana
irenge
abako
burimo
gatuwe
##byiniro
ashyira
cro
##kemuka
baseze
##rwenya
itsinze
wagize
icumu
##garagajwe
##riraho
ikizamini
antoine
##geka
agenga
moko
lon
batsinze
##kerezo
bitangazwa
kabe
ibihangano
mikorere
700
abonye
ishin
##bul
premi
damas
gutya
kuz
kugurisha
kwiya
baraba
##zamara
##sobanutse
muho
##ous
yasanze
abasaba
bukuru
soko
##sobanukiwe
##ved
burugu
abinyujije
250px
kwiteza
##koreraga
##kurikiranye
##garagaramo
##gendanwa
nina
ukeneye
yaza
##shimire
ikawa
hita
barya
zivuga
##cus
##manye
##nse
bapfa
yatsinzwe
##shyuza
akomoka
karuranga
bitwaje
##mine
##girango
umuha
##tingito
menya
inyoni
ruhame
##suzugura
##ganiriza
wikipe
food
bampo
green
iheruka
bafana
bashinjwa
gusohoka
george
skol
##garitswe
ngororero
amikoro
##unda
umukiri
wagiye
ubuke
zawe
kaban
kurangira
bazamu
##leb
habaru
yongeraho
perefegitura
##ln
rose
igitambo
##ffi
abitabiriye
##itor
again
dist
##sengimana
kumenyekana
##tizo
matayo
zituma
impeta
##tt
##yer
##haha
like
##raneza
yaru
yashyizwe
pra
##boni
##yika
diya
yitabiriye
##irobi
minota
##sk
kubakwa
##sipanyo
bashoboye
augustin
byacu
about
abahamya
even
##gamiye
inyanja
ibimera
##ngirehe
gare
bemerewe
nyanja
arwaye
##23
##mad
cyayo
##cike
urugaga
baz
akeneye
imideli
sawu
hand
##lls
kumuha
witwaga
##magazine
nshaka
manage
ifumbire
##banzi
##gurishwa
##raf
mumu
##rum
nairobi
##mbuwe
yite
byabereye
##komeretse
imico
yishe
##vision
igu
uhu
kurenza
satani
##rem
gipimo
ndimi
##magaye
##yenzi
##higa
##gwate
##ronavirusi
ubujura
foot
zikora
good
##uard
##itsinda
biranga
bushake
byana
bitarenze
##hagararira
##vugira
byatewe
mibare
obama
wana
after
party
kab
##sub
camp
penaliti
##jurire
##rwanira
ukundi
abatishoboye
irengero
##bile
##sigara
these
##puta
anastase
##tangazwa
##vie
imibanire
##mc
ibiba
ukuboko
damasc
##kh
##ibi
##nyu
##ruti
gusoza
##twaro
kugerageza
##bane
york
imbaga
economic
ubutasi
imyigaragambyo
##ps
##muco
umuhondo
yere
2007
yavukiye
##itekerereze
##rengagiza
ngororamu
##au
inkweto
abaye
ibirunga
buyapani
abanzi
##torewe
##hutisha
73
##mati
guko
iyica
mpi
##mme
munezero
ubukana
##miza
baregwa
##ganzo
##ndera
nyabihu
ikorwa
yinjira
##roma
twavuga
live
##shime
##mie
white
bakan
kwinjiza
##rindi
ihame
kugarura
##masi
##bonamo
tatu
izabera
burugumes
##cr
gusobanukirwa
ibiyaga
imigani
##nick
shingiro
asigaye
uyoboye
bama
rwandamagazine
##vel
##itekereza
jambo
bategereje
##ziza
twagira
kwandi
udupfukamunwa
bikomeje
ahamya
provi
gitan
##rch
##remezo
##simbuye
bushingiye
ant
##inema
ruhe
bagombaga
##sita
indo
##kecuru
##hane
##yamatsiko
##itwaye
mwami
budasanzwe
ashingiye
sene
##rembo
##tifi
byagaragaye
##nararibonye
global
##jinya
muki
mazina
bahungiye
work
gt
wayi
demo
bagamije
asso
##cle
##hererekanya
bizwi
##tangirwa
uruhushya
power
ivangura
inf
cnlg
##17
##bigwi
any
nyamata
##taye
##haza
hariho
simba
##sanganyamatsiko
akaga
meddy
##urce
umutesi
##ngiro
iburyo
baptiste
##fen
impaka
uburusiya
amacakubiri
##garagarira
miriyoni
mpe
##hemuka
clo
vu
##ruke
uburundi
nizo
rube
##ines
##muremyi
kwerekeza
##itiriwe
umwijima
mwese
9c
umuganda
##tiri
##mbutse
##kiriwe
igize
58
##kuta
tubikesha
yiswe
founda
##genera
mukerarugendo
##korezi
ziriya
mode
bitaba
56
66
##guka
##hama
##shobore
republic
avo
##vile
willia
well
kwihangana
amakoperative
mozambique
##mpaye
bungana
##kiniye
grace
##24
kigeze
##riyeho
wifuza
burugumesitiri
##phonse
muhungu
##rubozo
umusoro
gushishikariza
bishimira
young
aramubwira
twumva
##gijwe
war
##iteguro
bou
ryayo
koronavirusi
arc
asimbuye
eti
##kiya
hasigaye
ruge
##herereza
edouard
foundation
wit
zuba
kevin
ayisumbuye
iruhande
64
##gon
rab
faustin
akina
bumenyi
profe
bashyira
ukuba
dar
99umu
roya
igitutu
##et
kiro
irindi
##kenerwa
##teganya
kim
ito
barangije
uhuza
bacye
big
bibli
##genderaho
emp
wanyu
yerekanye
ikina
chall
akurikiranyweho
##im
##higwa
cyatumye
isiga
##garijwe
aheruka
fr
##giritse
gukuraho
bifitanye
tur
ikaza
kugeraho
yakunze
domini
kujyana
##randa
ahora
##mvikane
muge
##batsi
zishinzwe
lau
##geya
ipa
ugera
kuro
##bwiwe
ntizi
ukumva
bakekwaho
ato
##lita
guhitamo
vis
ran
rbc
##gerere
##bero
##hohotera
##geragere
perezi
abigishwa
indangagaciro
##buja
imvaho
##giramo
imihigo
##gejejwe
amasegonda
##shen
football
bakin
ubwigenge
##tandaro
##ozo
amahame
nonese
gutakaza
icyuho
85
umugaba
inziti
##hato
ubusu
ibikomoka
##beraga
kwamamaza
ineza
ibitangazamakuru
##zanywe
sankara
amenyo
henshi
hashingiwe
chel
cami
cyera
##baro
gisi
##kwirakwizwa
bamporiki
yam
icyamamare
##yandikisha
gutura
wahawe
catego
yaramu
serivise
abatanga
umusaza
hy
##pt
##remwa
gushimira
abamotari
##nika
ihari
qa
umugongo
anti
amande
78
abahagarariye
igisa
isaac
ugeze
umuhe
umuhoza
cyanditse
##kuruza
gusambanya
experi
buso
mijyi
jeannette
gukorerwa
##deni
umuvunyi
basirikare
bashyize
gikundiro
itangaza
umwanzi
kuvugurura
##hangani
adver
##mple
##guriye
popu
##ronko
ibinyabuzima
##mugabo
##ranywe
kutagira
##yinya
##weri
gukangurira
abakandida
##dom
bavugaga
##sipanyole
itangira
gupima
##itezwe
kalisa
ibirwa
rema
byibura
igenzura
uzajya
itangwa
bwaba
##itange
bagiranye
ukabona
igare
nkora
bakwi
##garamu
##jiji
kwanga
startimes
iyicarubozo
ikwiye
gukundana
jack
idu
respon
##hiti
cyawe
bataza
ubutunzi
bukangurambaga
aregwa
hakurikijwe
##rahi
bafatiwe
yashimye
##biye
nawo
amarangamutima
##mubwira
##geri
support
gutangwa
##somye
arangije
inspe
ntama
tri
##cca
umwanda
information
challenge
ugi
bateye
abagororwa
urusobe
abayisilamu
##banji
kali
ukabije
##uru
majwi
bakagira
##riste
rwagasana
marines
##dji
kuran
bareba
umwo
cyuba
kabari
67
##bita
ukina
umukoresha
abahe
news
kwitabwaho
byumba
##sto
##rara
##yumu
##nis
##rinze
nzaboni
##gavu
##rena
##hanyuma
fatizo
utwo
##seka
akagira
juven
binyamakuru
##rwi
