<unk>	0
<s>	0
</s>	0
[CLS]	0
[UNK]	0
?	0
.	0
'	0
;	0
[MASK]	0
[PAD]	0
:	0
!	0
,	0
[SEP]	0
▁	-1.78232
’	-3.54293
▁n	-4.211
▁1	-4.30327
▁2	-4.39102
▁mu	-4.52236
▁b	-4.99018
1	-5.05273
▁y	-5.09031
Sm	-5.15082
▁i	-5.16225
Ng	-5.17393
▁ku	-5.22293
Bm	-5.23573
2	-5.24301
▁Zb	-5.24744
▁“	-5.2524
▁na	-5.27874
▁Gut	-5.28086
▁Kv	-5.30245
▁Yehova	-5.32446
▁It	-5.37244
▁a	-5.41426
▁Kb	-5.45602
▁c	-5.47087
”	-5.49202
3	-5.49951
▁d	-5.501
▁g	-5.50928
▁k	-5.51038
▁w	-5.51276
▁h	-5.52782
▁f	-5.54133
5	-5.54763
6	-5.57389
7	-5.57874
4	-5.61592
▁j	-5.62797
▁3	-5.64523
8	-5.6568
9	-5.65722
▁ati	-5.67563
▁e	-5.67806
▁m	-5.68982
▁ya	-5.71985
▁Lw	-5.72456
▁7	-5.72572
▁ni	-5.73051
▁l	-5.73536
10	-5.74306
▁4	-5.76772
▁9	-5.7808
i	-5.79183
▁6	-5.79402
▁Ys	-5.80492
▁wa	-5.8229
11	-5.83071
13	-5.85934
12	-5.87371
▁kandi	-5.87677
▁10	-5.88868
▁5	-5.89456
▁8	-5.89592
a	-5.90809
14	-5.91768
▁12	-5.92046
15	-5.92307
▁11	-5.98236
▁ngo	-6.0013
16	-6.00318
▁15	-6.00396
17	-6.01832
e	-6.04207
▁we	-6.05137
18	-6.05707
▁18	-6.07609
▁14	-6.07915
▁13	-6.10481
▁o	-6.10734
19	-6.11557
▁muri	-6.13784
▁Img	-6.14653
▁20	-6.15338
▁r	-6.15624
▁p	-6.15872
▁16	-6.16779
▁Nuko	-6.18033
▁ko	-6.18251
▁19	-6.18428
20	-6.18671
▁ba	-6.2057
▁17	-6.21756
▁Abc	-6.23702
▁Ye	-6.25807
▁ari	-6.26743
21	-6.2686
▁21	-6.28202
▁23	-6.29891
▁Imana	-6.33536
▁22	-6.34716
▁yari	-6.36195
E	-6.37427
▁u	-6.39281
C	-6.3981
22	-6.40544
▁28	-6.44069
▁s	-6.45899
23	-6.4601
▁bari	-6.46475
24	-6.46806
▁nk	-6.47011
▁IGI	-6.48924
▁24	-6.48945
▁26	-6.49118
▁25	-6.49662
▁bose	-6.51389
25	-6.53361
▁kuko	-6.53977
▁z	-6.55963
▁t	-6.5796
▁̨	-6.59345
26	-6.60691
29	-6.62693
▁kugira	-6.63047
▁cy	-6.63517
27	-6.64278
▁bo	-6.64768
▁umwami	-6.66555
▁Dawidi	-6.66817
▁Yr	-6.66819
▁imbere	-6.67728
▁mwene	-6.67751
▁‘	-6.68498
-	-6.68541
28	-6.69782
▁ry	-6.706
▁Nh	-6.71026
▁27	-6.72856
▁yo	-6.73878
▁29	-6.75838
uko	-6.79577
▁32	-6.79828
▁uwo	-6.81125
▁maze	-6.81974
▁munsi	-6.84577
▁Isirayeli	-6.84591
▁Yb	-6.84994
▁31	-6.872
30	-6.88035
▁gihugu	-6.88498
▁Mose	-6.88619
31	-6.88868
▁byose	-6.89034
▁cyangwa	-6.89127
▁kuri	-6.90708
▁30	-6.92028
▁Hb	-6.94207
▁no	-6.94668
▁34	-6.99758
▁cya	-7.02392
▁aho	-7.03144
▁33	-7.03415
▁Inkingi	-7.04821
▁yawe	-7.0617
▁yose	-7.0648
▁bene	-7.07402
33	-7.0768
▁Ibk	-7.07768
u	-7.08566
▁be	-7.09807
o	-7.09828
▁icyo	-7.10641
▁Mt	-7.10726
▁Abisirayeli	-7.11199
▁ibyo	-7.11748
▁mirongo	-7.11924
▁Ezr	-7.12372
▁v	-7.13156
▁se	-7.1342
▁ye	-7.17094
▁Ariko	-7.17476
▁nzu	-7.18304
▁abwira	-7.18881
▁abantu	-7.19915
ye	-7.2042
Kr	-7.20991
▁bati	-7.22781
▁rw	-7.23274
32	-7.24215
▁nta	-7.24759
▁cyane	-7.25071
Imana	-7.25425
▁by	-7.26281
▁Kandi	-7.26605
▁Hanyuma	-7.27098
▁bw	-7.27796
▁Ezk	-7.27829
▁35	-7.31265
▁kugeza	-7.31466
▁I	-7.32026
34	-7.33938
▁wawe	-7.34027
▁Lk	-7.35476
▁cyo	-7.35548
ho	-7.3689
▁yabo	-7.37672
▁byo	-7.39024
35	-7.39655
▁igihe	-7.40737
▁gihe	-7.42373
▁37	-7.42636
umwami	-7.439
▁Rm	-7.44408
▁wo	-7.4551
▁Ni	-7.45606
▁Mu	-7.45887
▁36	-7.45972
ra	-7.46506
▁wese	-7.47574
▁ariko	-7.48327
▁ho	-7.49419
▁Sawuli	-7.51283
▁Est	-7.52027
▁cumi	-7.53106
▁umuntu	-7.53545
▁A	-7.56765
▁Egiputa	-7.57287
we	-7.59268
▁iyo	-7.60711
ga	-7.60822
▁rya	-7.62239
umuriro	-7.6231
ukuri	-7.62483
Abisirayeli	-7.6252
▁igitambo	-7.62919
▁yanjye	-7.64691
ibyo	-7.6489
36	-7.64962
38	-7.66787
▁Umb	-7.69402
▁Yerusalemu	-7.70161
▁buri	-7.70191
▁wari	-7.70608
▁zahabu	-7.71185
▁Aroni	-7.71437
ni	-7.71684
▁za	-7.72066
▁yanyu	-7.72073
▁magana	-7.73364
37	-7.74996
Zb	-7.75368
intama	-7.774
▁38	-7.77967
▁imyaka	-7.78565
▁N	-7.78565
▁40	-7.78683
▁aba	-7.78964
▁aravuga	-7.80279
▁hejuru	-7.80747
▁rwa	-7.81023
▁kwa	-7.81523
▁ibihumbi	-7.81801
▁Umwami	-7.82322
▁mugi	-7.82356
wa	-7.83821
n	-7.8386
Pt	-7.83861
▁hamwe	-7.83904
ingabo	-7.84611
39	-7.8485
d	-7.84973
▁iki	-7.85181
▁Buyuda	-7.85825
▁None	-7.88218
▁kumwe	-7.88511
▁aramubwira	-7.88798
▁Dn	-7.89111
▁wanjye	-7.89251
▁Salomo	-7.89425
▁Uwo	-7.90135
▁cyose	-7.9129
inzu	-7.91551
▁49	-7.92363
▁itatu	-7.92865
▁zose	-7.942
▁bwa	-7.94869
na	-7.95143
▁umwe	-7.95327
▁mwe	-7.95534
40	-7.96124
b	-7.96736
▁muntu	-7.96965
mo	-7.97182
c	-7.98155
▁wowe	-7.9933
▁bawe	-7.99487
▁44	-7.99646
▁abo	-7.99865
▁makumyabiri	-8.00418
▁39	-8.00671
arawo	-8.00981
▁hari	-8.01282
Yehova	-8.01488
▁umutambyi	-8.02205
▁sekuruza	-8.02854
▁U	-8.03186
▁Yakobo	-8.03535
▁nti	-8.04176
▁46	-8.05656
abantu	-8.06893
▁ajya	-8.07101
▁neza	-8.07259
▁Yh	-8.07764
▁kimwe	-8.08033
▁maso	-8.08753
▁muryango	-8.08901
▁afite	-8.0902
▁uko	-8.09561
g	-8.10451
▁Ibh	-8.10577
▁izina	-8.10696
h	-8.10815
za	-8.11512
▁B	-8.12187
p	-8.12727
▁igihugu	-8.12911
▁bya	-8.12916
41	-8.12999
▁kuba	-8.1326
▁Yozefu	-8.14489
▁babo	-8.14538
▁41	-8.14564
▁bwe	-8.15189
▁uyu	-8.15769
▁Yosuwa	-8.16202
▁umugaragu	-8.16673
▁hagati	-8.1705
▁ze	-8.18009
▁umutware	-8.18433
▁abyara	-8.18501
▁Icyo	-8.18563
▁aza	-8.19007
▁Iyo	-8.19466
abahungu	-8.2008
mu	-8.20343
▁mbere	-8.20744
▁Ba	-8.20915
▁Bene	-8.21601
yo	-8.22401
▁Rs	-8.2263
▁isi	-8.22709
▁irindwi	-8.22861
▁gikongorwa	-8.2288
▁umugisha	-8.22949
ya	-8.23206
f	-8.23243
l	-8.23988
▁ndi	-8.24081
▁inzu	-8.24238
43	-8.24364
▁Y	-8.24428
abo	-8.25242
▁bwo	-8.25283
▁zo	-8.25327
m	-8.26087
▁Yk	-8.26718
42	-8.26906
▁yacu	-8.27259
▁78	-8.27679
▁Abo	-8.27792
▁gakondo	-8.2803
Gut	-8.28213
▁42	-8.30806
▁butayu	-8.30843
▁ihema	-8.30935
umuryango	-8.31603
▁cye	-8.317
ze	-8.31834
▁ibintu	-8.32246
▁umuhungu	-8.32681
▁rugo	-8.32742
▁ahita	-8.32831
44	-8.33338
ira	-8.33447
▁umugore	-8.33468
▁nawe	-8.33998
▁umutima	-8.34047
▁nde	-8.34744
▁nzira	-8.34771
▁akaba	-8.3496
▁uti	-8.34982
▁migi	-8.35046
k	-8.35133
▁itanu	-8.35437
uwo	-8.3572
▁Hs	-8.36052
▁kabiri	-8.36405
Yr	-8.3642
▁hanyuma	-8.36898
▁iminsi	-8.37117
▁bantu	-8.37162
A	-8.37412
ihema	-8.37426
45	-8.37646
▁Am	-8.37784
▁rye	-8.38184
▁akomeza	-8.38782
▁Ku	-8.38878
▁Yorodani	-8.39246
▁bibiri	-8.39471
▁hafi	-8.39831
▁ryose	-8.39926
▁abagabo	-8.40039
Inkingi	-8.40365
▁bi	-8.40678
j	-8.40804
▁Nanone	-8.40934
▁Nyuma	-8.41429
▁mwaka	-8.41452
▁umukobwa	-8.41531
▁yayo	-8.42421
re	-8.42753
▁106	-8.42779
▁Aburahamu	-8.43079
▁Amaherezo	-8.43079
▁Ibyo	-8.43161
▁umwana	-8.43255
▁zi	-8.4389
▁uri	-8.43892
▁ka	-8.44411
Yh	-8.44518
▁ibitambo	-8.44928
▁abahungu	-8.45273
umwe	-8.45517
▁ri	-8.45634
▁azaba	-8.46029
▁ingabo	-8.46352
uyu	-8.46936
▁afata	-8.48052
▁iri	-8.48085
▁hasi	-8.48172
▁bitewe	-8.48189
▁babiri	-8.482
▁niba	-8.48338
▁abagaragu	-8.48884
Tm	-8.48992
▁amagambo	-8.49062
ri	-8.49607
▁ayo	-8.50237
▁gicaniro	-8.50362
▁baza	-8.50832
▁ijana	-8.50836
▁45	-8.51027
▁bwanjye	-8.51362
▁Mk	-8.51574
▁105	-8.51588
▁buryo	-8.51734
▁abatware	-8.52131
abavandimwe	-8.52183
▁umugabo	-8.5224
▁musozi	-8.5226
▁amavuta	-8.52654
▁ra	-8.52783
▁jye	-8.53205
▁ukuboko	-8.53947
▁maboko	-8.54165
51	-8.54822
▁ine	-8.54915
ibonaniro	-8.55078
▁aha	-8.55224
▁gukora	-8.55369
▁Muri	-8.55636
▁ikintu	-8.56017
▁bajya	-8.56106
▁aramusubiza	-8.56135
▁Nta	-8.56279
▁Icyakora	-8.57057
▁uza	-8.57641
▁kuva	-8.5835
▁bwawe	-8.58431
ibinyampeke	-8.58582
▁ijwi	-8.58702
▁inkota	-8.58721
46	-8.59007
▁43	-8.59323
▁Yowabu	-8.59437
▁yabyaye	-8.59593
▁icumi	-8.59722
Abalewi	-8.60106
▁ubwoko	-8.60204
▁yaho	-8.60325
▁mugore	-8.60466
aho	-8.60833
▁50	-8.6099
▁Zk	-8.61183
▁ibyaha	-8.61259
▁Na	-8.61354
▁mugabo	-8.61895
umuntu	-8.6204
▁yakoze	-8.62143
Ye	-8.62222
r	-8.62723
▁bwoko	-8.62765
▁Ml	-8.62816
▁hose	-8.63386
▁Yuda	-8.63499
47	-8.64124
dore	-8.64484
▁amazi	-8.6463
▁databuja	-8.64781
▁ngoma	-8.64888
▁imirimo	-8.65084
▁Samweli	-8.65166
▁ryo	-8.65293
▁banyu	-8.65327
▁amaraso	-8.65337
▁Mana	-8.65421
▁48	-8.65452
▁S	-8.65544
▁ahubwo	-8.65551
▁Manase	-8.66469
▁Aba	-8.67432
▁rwose	-8.67497
ba	-8.67667
▁gitondo	-8.68126
▁ijuru	-8.68129
▁bafite	-8.68208
▁umunsi	-8.68313
t	-8.68363
Img	-8.68493
▁Ef	-8.69329
▁karere	-8.69551
▁bitarondoreka	-8.70311
w	-8.70528
▁umurimo	-8.70701
▁wabo	-8.70741
amazi	-8.70835
▁imigi	-8.71084
aba	-8.71174
▁data	-8.71427
▁mutwe	-8.71589
Abafilisitiya	-8.71811
▁hakurikijwe	-8.7194
▁Dore	-8.72027
▁ubwoba	-8.72231
I	-8.72259
aga	-8.72464
icyo	-8.72547
▁bintu	-8.72795
▁isezerano	-8.73151
▁abatambyi	-8.73446
▁bwose	-8.73669
▁nanjye	-8.73733
▁Igihe	-8.73865
umugore	-8.73917
▁Abalewi	-8.7418
▁shekeli	-8.74435
48	-8.74722
50	-8.74893
▁Yonatani	-8.75419
▁ituro	-8.75437
▁ruhande	-8.75495
▁iryo	-8.75523
▁mukuru	-8.75625
s	-8.75881
abagaragu	-8.76117
▁uwa	-8.76123
▁Cyangwa	-8.76413
abana	-8.76751
▁nda	-8.76767
umuhungu	-8.76807
▁abana	-8.77046
49	-8.7709
▁byari	-8.77213
abatware	-8.77237
▁imbaraga	-8.7732
▁amaso	-8.77337
▁minsi	-8.77701
amasambu	-8.77715
▁47	-8.78015
▁zabo	-8.78267
▁bu	-8.78387
▁Ese	-8.79322
▁Isaka	-8.79568
▁amategeko	-8.79666
ifeza	-8.79735
▁undi	-8.80707
▁ma	-8.80824
▁ahantu	-8.81049
▁iteraniro	-8.81173
▁wose	-8.81596
▁ab	-8.81876
▁batuye	-8.81957
▁Kuko	-8.82656
▁ibi	-8.82934
▁Abantu	-8.83688
ari	-8.83737
▁icyaha	-8.84141
ihene	-8.84264
▁Mbese	-8.84454
▁inyuma	-8.84545
▁amahoro	-8.84556
intambara	-8.8484
▁abe	-8.8514
▁ubwo	-8.8545
▁asanga	-8.85631
▁gu	-8.85761
ese	-8.8587
▁gitambirwa	-8.85991
▁kubera	-8.8603
▁benshi	-8.86248
bwira	-8.86327
reka	-8.8661
▁Gl	-8.86733
▁mutima	-8.86787
▁isanduku	-8.87004
▁Uko	-8.87121
▁M	-8.87341
▁ubu	-8.8802
▁Ab	-8.88185
▁Mr	-8.88207
▁byabo	-8.88292
▁ubugingo	-8.88358
▁mwana	-8.88579
▁ibibi	-8.88671
▁umu	-8.88706
▁gutamba	-8.88942
▁ryanjye	-8.89086
Abc	-8.89331
▁NGOMA	-8.89888
▁Abusalomu	-8.90073
▁ibihe	-8.90077
imikono	-8.90251
▁bara	-8.90337
▁ibyokurya	-8.90417
▁55	-8.90742
▁mi	-8.90796
▁arababwira	-8.91052
▁so	-8.91217
▁kwezi	-8.91259
ituro	-8.9132
ABAMI	-8.917
▁divayi	-8.91886
gira	-8.92046
▁urubanza	-8.92254
▁rugamba	-8.92277
iyo	-8.92377
IGI	-8.92778
▁ukuvuga	-8.92915
▁ufite	-8.92925
▁Reba	-8.93049
abakobwa	-8.93111
amavuta	-8.9327
▁Elisa	-8.94084
▁abiri	-8.94297
imisozi	-8.94509
▁Abafilisitiya	-8.94635
▁rwe	-8.9479
▁none	-8.94839
▁Bisirayeli	-8.9496
▁Amg	-8.94962
ibiti	-8.95014
▁52	-8.95072
▁Beti	-8.95157
▁119	-8.95329
▁Umuntu	-8.95421
▁ifeza	-8.95445
AM	-8.95786
▁ndetse	-8.9592
▁gusa	-8.96151
▁G	-8.96635
▁abona	-8.96768
▁amabuye	-8.96933
▁karindwi	-8.97072
▁Ahabu	-8.97207
▁89	-8.97424
▁yaba	-8.97498
y	-8.98671
genda	-8.98953
ELI	-8.98986
▁imwe	-8.99117
▁Umugereka	-8.99187
▁gatatu	-8.99189
▁rero	-8.99296
▁naho	-8.99357
▁ajye	-8.99545
▁amatwi	-8.99835
ubwami	-8.9984
▁ara	-9.00038
▁Esawu	-9.00433
▁ingoma	-9.0067
▁mpamvu	-9.00727
▁Niba	-9.00755
▁kurusha	-9.00949
amabuye	-9.01129
ka	-9.01146
je	-9.01278
▁iti	-9.01945
▁tu	-9.02479
▁gitabo	-9.02561
▁si	-9.02761
▁imana	-9.02817
abandi	-9.02905
amazu	-9.03041
▁izo	-9.03113
▁kibaya	-9.03212
ko	-9.03339
abatambyi	-9.03373
▁Bayali	-9.03571
▁kubwira	-9.03636
▁namwe	-9.03764
▁miremire	-9.03787
▁ujye	-9.0397
▁amara	-9.04193
▁yar	-9.04298
▁uw	-9.04541
abami	-9.05158
▁Umutambyi	-9.05305
imiryango	-9.0542
iki	-9.05421
▁itegeko	-9.05455
▁Gileyadi	-9.05888
▁giheburayo	-9.06066
▁butaka	-9.06073
▁amaze	-9.06176
▁rwawe	-9.0625
▁bajye	-9.06253
▁imyenda	-9.06256
▁Yerobowamu	-9.06277
Ys	-9.06799
▁zari	-9.07017
▁inzira	-9.07233
▁ahakikije	-9.07523
▁bar	-9.07652
umugi	-9.07874
▁magambo	-9.07903
▁nka	-9.08189
▁Uza	-9.08436
▁banjye	-9.08492
▁igicaniro	-9.08634
▁kujya	-9.08636
▁he	-9.09171
▁itandatu	-9.09291
igiti	-9.09449
▁bikongorwa	-9.09449
▁amaboko	-9.09523
▁51	-9.09578
abagabo	-9.09668
▁rwo	-9.09981
▁hantu	-9.10023
▁baba	-9.10184
▁Efurayimu	-9.1062
▁miryango	-9.10759
▁nabi	-9.10786
▁Buri	-9.10936
ti	-9.10963
▁Yobu	-9.10991
▁Hezekiya	-9.11021
▁sokuruza	-9.11836
52	-9.119
55	-9.12099
▁ntu	-9.1211
▁kw	-9.12138
▁atangira	-9.12649
▁atandatu	-9.12667
▁iby	-9.13149
▁abagore	-9.13404
▁hano	-9.13832
▁Mowabu	-9.14094
ne	-9.14163
Kv	-9.14242
▁cyimbo	-9.14308
▁inkingi	-9.14405
▁bakora	-9.14735
▁ubusa	-9.14839
▁Eliya	-9.14918
▁”	-9.15028
v	-9.15133
▁ikimasa	-9.15402
▁urugero	-9.15581
▁umugi	-9.15582
Kb	-9.15673
▁abaturage	-9.1591
U	-9.15996
▁umwaka	-9.16134
▁wanyu	-9.16377
▁ru	-9.16646
▁INTANGIRIRO	-9.1687
▁iruhande	-9.16941
▁abavandimwe	-9.17056
▁Kanani	-9.17067
▁kubaho	-9.17106
▁agiye	-9.17243
▁aramubaza	-9.17275
▁bakomeza	-9.17415
▁yohereza	-9.17427
▁abandi	-9.17432
▁bye	-9.17676
▁impongano	-9.17916
▁ijambo	-9.17921
▁iyi	-9.1816
▁nyina	-9.18168
▁umuvandimwe	-9.18286
ab	-9.18429
ibi	-9.18432
▁nkambi	-9.18571
▁bakambika	-9.18736
▁asubiza	-9.18844
▁uhereye	-9.19396
▁Yehoshafati	-9.19495
▁myaka	-9.19617
▁twe	-9.19995
▁atanu	-9.20135
▁68	-9.20376
▁ibiri	-9.2038
▁mahanga	-9.20386
isi	-9.2039
▁gasozi	-9.20798
▁Benyamini	-9.21032
▁ebyiri	-9.21463
▁atatu	-9.21507
▁bak	-9.21677
▁intumwa	-9.21738
▁yongera	-9.21861
icyaha	-9.21879
▁kurya	-9.22301
intwari	-9.2232
▁igihumbi	-9.22386
▁nimugoroba	-9.22392
▁arindwi	-9.23299
▁kure	-9.23581
▁yera	-9.23698
▁Heburoni	-9.23753
▁bagera	-9.24041
▁atuma	-9.24227
▁ryari	-9.24409
▁iwe	-9.24548
isezerano	-9.24829
▁mazi	-9.24872
▁nyinshi	-9.24939
▁mwami	-9.25069
▁re	-9.25138
▁twa	-9.25196
▁kintu	-9.25663
▁Samariya	-9.26321
▁mujye	-9.26698
amatungo	-9.26771
▁incuro	-9.2682
ingoma	-9.26909
igicaniro	-9.26934
▁yavuze	-9.2694
ura	-9.2695
▁ubwa	-9.27189
▁nyuma	-9.27256
▁Yehu	-9.27456
ndi	-9.27544
imbere	-9.27607
▁meza	-9.27858
▁yuje	-9.2786
▁yitwaga	-9.27864
jye	-9.27918
▁Asa	-9.28125
▁urukundo	-9.28224
▁hova	-9.28315
▁bava	-9.28331
▁Yeho	-9.28416
▁aka	-9.28553
▁Naho	-9.28598
▁nza	-9.28603
kuki	-9.28611
Lw	-9.28889
Ts	-9.29026
▁imiryango	-9.29556
▁KU	-9.29626
▁bacu	-9.29762
ukwezi	-9.29936
▁K	-9.30024
▁bahungu	-9.30267
▁giti	-9.30645
▁Ashuri	-9.30662
▁mugenzi	-9.30686
umugaragu	-9.30789
▁binyuze	-9.30938
▁agira	-9.30995
▁ak	-9.31256
amategeko	-9.31632
▁ava	-9.31977
▁cyari	-9.32003
▁akora	-9.32085
▁Eleyazari	-9.32408
▁kubaka	-9.32525
igihugu	-9.32684
▁murima	-9.32696
▁imyambaro	-9.32743
▁ineza	-9.32781
▁mana	-9.32835
▁babwira	-9.33351
54	-9.33395
▁ubwenge	-9.33536
▁KUBARA	-9.3366
▁rukagera	-9.33687
▁abanzi	-9.33935
▁gupfa	-9.33986
▁Abimeleki	-9.34179
uri	-9.3426
▁kwe	-9.34295
▁ryawe	-9.34536
ubu	-9.3465
ubwoko	-9.3488
▁aragenda	-9.34964
▁nziza	-9.35254
▁batatu	-9.35255
▁inama	-9.35708
ire	-9.35819
▁muti	-9.3618
▁kuvuga	-9.36197
▁cyawe	-9.36224
53	-9.36309
▁yica	-9.36613
▁uzaba	-9.3676
imidugudu	-9.37111
iburyo	-9.3718
▁kwawe	-9.37238
▁Aho	-9.37796
▁cyatumye	-9.37951
▁ki	-9.38274
umuringa	-9.38352
▁Balamu	-9.38612
▁nyanja	-9.38889
▁imigati	-9.38961
itanu	-9.39055
▁104	-9.39166
Nh	-9.39308
▁amafaranga	-9.39409
▁uzi	-9.39524
▁umwenda	-9.39718
▁ikindi	-9.39772
▁turi	-9.39833
▁yategetse	-9.40062
▁ha	-9.40191
▁Beteli	-9.40229
▁kugera	-9.40473
Mt	-9.40478
▁Eli	-9.40563
ane	-9.40709
▁ahumanye	-9.40781
ibiri	-9.41235
▁biri	-9.41408
▁byera	-9.41415
▁Hagati	-9.41597
▁Shekemu	-9.41603
▁Moridekayi	-9.41609
▁avuga	-9.41703
▁Yd	-9.41892
▁bitatu	-9.42043
▁Hari	-9.42544
amahanga	-9.42591
▁byiza	-9.42866
▁umuryango	-9.43093
▁atari	-9.43664
umunani	-9.43694
▁amazu	-9.43769
▁nkingi	-9.43802
▁Aburamu	-9.43819
It	-9.43911
ta	-9.44031
ifu	-9.44174
▁abakuru	-9.44655
▁bityo	-9.44964
▁byinshi	-9.44974
▁majyepfo	-9.4513
▁Rubeni	-9.4523
nta	-9.45355
▁gutura	-9.45686
▁cyabo	-9.45722
Ibk	-9.45727
▁Dani	-9.46098
▁ngiye	-9.46178
▁Gadi	-9.46637
▁imanza	-9.46673
▁witwaga	-9.46704
▁65	-9.46822
Abamori	-9.47249
▁Kuki	-9.47254
▁zawe	-9.47263
▁marembo	-9.47328
▁baka	-9.47412
zi	-9.47496
▁joro	-9.47529
si	-9.47568
▁kiri	-9.47631
▁tw	-9.47751
▁basanga	-9.4782
▁60	-9.48377
iteraniro	-9.48398
ibindi	-9.48417
▁batware	-9.48423
▁birebana	-9.48427
▁bagabo	-9.4861
Rib	-9.48663
igitambo	-9.48724
▁ibyiza	-9.48727
▁72	-9.48813
▁indi	-9.48989
▁ibyago	-9.49175
se	-9.49211
inyamaswa	-9.49666
iye	-9.4968
ibintu	-9.49963
tse	-9.50055
EKA	-9.50067
EG	-9.50098
▁ane	-9.5019
▁Labani	-9.50211
▁Hamani	-9.50213
▁ibikoresho	-9.50217
▁Hashize	-9.50218
▁rimwe	-9.50386
▁bunyage	-9.50468
▁YOBU	-9.50484
▁Samusoni	-9.50513
undi	-9.50734
▁bibe	-9.50736
▁at	-9.50757
▁Abuneri	-9.50811
▁batangira	-9.50954
▁uburakari	-9.51081
▁mbi	-9.51311
▁ategeka	-9.5143
inkuta	-9.51494
▁gitambo	-9.51747
amarembo	-9.51768
UT	-9.51881
umwana	-9.52079
Abamoni	-9.52099
▁natwe	-9.52111
umugabo	-9.5219
▁66	-9.52209
▁izindi	-9.5221
abanzi	-9.52575
ubugingo	-9.52583
igice	-9.52702
nda	-9.52789
z	-9.52937
▁intwaro	-9.5295
abagore	-9.531
▁ahamagara	-9.53193
▁aya	-9.53267
▁135	-9.53291
ibyokunywa	-9.53738
▁umuhigo	-9.53859
▁Yeriko	-9.539
▁rubanda	-9.53961
▁Esiteri	-9.54184
▁ifite	-9.54304
▁umuhanuzi	-9.54382
▁mva	-9.54673
ijuru	-9.54704
▁arapfa	-9.54776
▁mirimo	-9.54855
▁muringa	-9.5509
▁kare	-9.55116
▁ar	-9.55417
ibikoresho	-9.55519
▁Edomu	-9.5557
▁bombi	-9.55852
▁baramubwira	-9.55911
▁uburebure	-9.55984
indogobe	-9.56018
▁umutwe	-9.56061
▁cyanjye	-9.56143
▁aravuze	-9.56347
▁wacu	-9.56376
eho	-9.56413
▁burasirazuba	-9.56479
ibitambo	-9.56494
urugo	-9.56522
▁baravuga	-9.56558
▁umuja	-9.56571
▁budodo	-9.56636
▁wayo	-9.57258
▁mategeko	-9.57279
Ezk	-9.57441
▁Ndi	-9.57561
▁efodi	-9.57677
LE	-9.57691
▁Siriya	-9.57705
▁Yehoyada	-9.57897
▁bami	-9.58011
▁nijoro	-9.58026
fata	-9.58077
▁ntebe	-9.58198
▁mwa	-9.58253
ha	-9.58278
▁58	-9.58288
Hb	-9.58514
▁ajyana	-9.58693
▁gifite	-9.5879
▁ntara	-9.58899
igihe	-9.59362
Lk	-9.59573
▁Babuloni	-9.59653
▁inoze	-9.5966
▁arahaguruka	-9.60094
▁azicwe	-9.60163
amateka	-9.60169
▁majyaruguru	-9.60209
▁kureba	-9.60264
▁mwenda	-9.60346
li	-9.6049
▁inkoni	-9.60629
▁kujyana	-9.60777
▁koko	-9.61069
ku	-9.61082
ahera	-9.61148
▁Sadoki	-9.6164
▁Nowa	-9.61641
▁myinshi	-9.61655
▁Yehoramu	-9.61661
subiza	-9.61698
▁amabwiriza	-9.61875
▁Yw	-9.61891
▁rugabano	-9.61917
▁Gideyoni	-9.61976
▁ama	-9.62549
▁imbuto	-9.62617
▁baraza	-9.62683
N	-9.62807
▁bagiye	-9.62888
▁nuko	-9.62988
umu	-9.63003
▁kubona	-9.63078
ati	-9.63165
ma	-9.63533
▁zombi	-9.63692
▁menshi	-9.63693
▁bugufi	-9.63712
▁aratanga	-9.63736
▁ABA	-9.63829
▁yimye	-9.63894
▁Shimeyi	-9.64029
▁ubwami	-9.64054
▁abaza	-9.6432
bona	-9.6441
▁ashaka	-9.64558
▁83	-9.6459
▁agera	-9.64647
Umwami	-9.64685
▁Abanyegiputa	-9.64937
▁Ayo	-9.65026
▁abonye	-9.65238
ubudodo	-9.65332
▁iteka	-9.65381
▁Bari	-9.65501
▁atera	-9.65621
▁gito	-9.65713
▁pasika	-9.6576
▁bahita	-9.65988
uwa	-9.66017
▁nzima	-9.66044
▁Yari	-9.66091
▁inani	-9.66212
▁ubwoya	-9.66291
▁akiri	-9.66643
▁59	-9.66648
▁nyir	-9.66672
▁umwuka	-9.67325
ayo	-9.67435
▁urugimbu	-9.67467
▁Lewi	-9.67883
▁Rasheli	-9.6789
▁Yehowashi	-9.67903
▁impande	-9.67904
▁ishusho	-9.67922
▁63	-9.68211
▁yacyo	-9.68217
▁bahawe	-9.68307
▁mw	-9.685
▁ukora	-9.6851
nye	-9.68705
▁umubavu	-9.68777
▁va	-9.69087
▁cyumba	-9.69172
▁nari	-9.69283
▁igare	-9.69417
▁amahanga	-9.6969
▁inyama	-9.69847
uka	-9.69979
▁57	-9.70041
▁Bibiliya	-9.70065
▁inenge	-9.70068
▁gutambira	-9.70078
▁njye	-9.70178
▁Hk	-9.70423
▁abyumvise	-9.70518
hari	-9.70576
▁ndwi	-9.70599
▁amuha	-9.70627
▁nga	-9.7066
▁kimasa	-9.70799
▁abari	-9.70806
▁yara	-9.7105
▁Kubera	-9.71153
▁107	-9.71204
▁zayo	-9.71224
abanyambaraga	-9.71336
▁uk	-9.7154
▁ushaka	-9.71682
▁mushiki	-9.71724
▁kane	-9.71828
▁Isanduku	-9.71833
agaciro	-9.71836
va	-9.71911
▁agenda	-9.71982
▁imfura	-9.72041
▁yanga	-9.72198
ndakwinginze	-9.72231
▁iminyago	-9.72285
imfura	-9.7231
▁zanjye	-9.72489
iri	-9.72595
▁Kl	-9.72635
▁batera	-9.72642
▁ikimenyetso	-9.72643
▁bamaze	-9.72797
niba	-9.72993
▁bamwe	-9.73169
▁ngabo	-9.73277
▁bafata	-9.73633
▁Ayi	-9.73644
▁misozi	-9.73834
▁ndakwinginze	-9.74358
umutuku	-9.7443
ubururu	-9.7443
▁hakurya	-9.74554
▁Azariya	-9.74556
▁Gibeya	-9.74601
▁kurwana	-9.74647
▁mukobwa	-9.74696
abakuru	-9.74714
▁bwiza	-9.74773
▁umubare	-9.74895
▁yima	-9.74966
▁103	-9.74986
▁ibara	-9.75045
▁mfite	-9.7511
▁ibimasa	-9.75141
▁Abayahudi	-9.75161
mara	-9.75169
▁yamaze	-9.75437
▁umwa	-9.75505
▁ubutunzi	-9.75661
▁Kuri	-9.75678
umutima	-9.75815
Ariko	-9.75873
▁mba	-9.76093
uburemere	-9.76218
▁kanwa	-9.76235
▁ntib	-9.76593
▁uz	-9.76628
▁Rehobowamu	-9.76884
▁kabuza	-9.76897
▁murimo	-9.77069
▁byanyu	-9.77117
▁gi	-9.77194
▁Umutware	-9.7726
▁Gati	-9.77261
▁Abayuda	-9.77283
▁baragenda	-9.77326
ama	-9.7737
▁mukora	-9.77371
▁cyenda	-9.77395
abagize	-9.77402
63	-9.77518
▁matungo	-9.77537
▁umurage	-9.77582
▁Iryo	-9.77985
▁H	-9.78039
0	-9.78066
▁kose	-9.78092
▁bihe	-9.78556
60	-9.78571
akoze	-9.78658
▁irembo	-9.79187
▁Ibindi	-9.79274
▁Bashani	-9.79281
▁mugaragu	-9.79415
▁kwanjye	-9.7942
▁bagenda	-9.79645
umusozi	-9.79726
▁az	-9.79787
uku	-9.79952
▁ruhu	-9.80109
▁Aza	-9.80319
Umb	-9.80418
nimu	-9.80505
amaraso	-9.80552
▁56	-9.80684
▁guha	-9.81185
amasekurume	-9.81231
yi	-9.8134
▁ub	-9.81426
▁Ahubwo	-9.81686
▁Amasiya	-9.81689
▁Zekariya	-9.81693
▁shebuja	-9.81694
▁ukageza	-9.8171
▁gatanu	-9.81719
▁itunganyijwe	-9.81726
▁kirere	-9.82008
▁idasembuwe	-9.82025
▁Beri	-9.8211
▁uba	-9.82164
▁ruzi	-9.8225
▁bwabo	-9.82266
▁imitwe	-9.82448
▁ubuzima	-9.82692
▁umwimukira	-9.82821
▁Hg	-9.8293
▁uru	-9.82997
▁isabato	-9.83083
▁amu	-9.83125
▁umugabane	-9.83243
▁bavuga	-9.83539
▁rusengero	-9.83593
▁indogobe	-9.83616
▁gabo	-9.83651
sha	-9.84113
▁Yezereli	-9.8419
▁Natani	-9.84194
▁bisangirwa	-9.84194
▁Yesayi	-9.84197
▁sogokuruza	-9.842
▁amazina	-9.84275
▁batanu	-9.84282
▁amwita	-9.84372
andi	-9.84396
gera	-9.84419
▁gutanga	-9.84465
▁Rama	-9.84542
▁Mika	-9.84547
ugira	-9.84554
▁69	-9.84728
▁bituma	-9.84775
Umuntu	-9.85012
▁murumuna	-9.8504
▁yumvise	-9.85325
▁abami	-9.85447
▁tegeko	-9.85602
Ezr	-9.85668
imigati	-9.8569
▁babi	-9.85771
▁kizaba	-9.85793
▁inda	-9.85837
▁inzara	-9.85847
▁Balaki	-9.85853
ingano	-9.86239
▁Baza	-9.86561
umutambyi	-9.86612
amaturo	-9.86687
▁Benaya	-9.86744
▁two	-9.86746
YOS	-9.86827
▁bwinshi	-9.8692
▁babaga	-9.86926
▁imvura	-9.86976
▁manywa	-9.86995
▁wenyine	-9.87045
▁54	-9.87087
▁uretse	-9.87132
▁efa	-9.87181
▁muza	-9.87208
iminsi	-9.87389
▁bine	-9.87444
jyana	-9.87544
▁burengerazuba	-9.87617
itatu	-9.87735
▁azabe	-9.87756
58	-9.87882
▁Nafutali	-9.88032
inyanja	-9.88114
ibihe	-9.88164
▁abakobwa	-9.88364
▁akurikije	-9.8839
abaturage	-9.88454
▁bazajya	-9.88543
nga	-9.88604
di	-9.88871
▁Yn	-9.88985
▁icyubahiro	-9.89055
▁Ahazi	-9.89259
▁ibya	-9.89323
▁ABACAMANZA	-9.89385
▁Betelehemu	-9.89386
▁yaramye	-9.89387
▁gukuraho	-9.89717
▁gihumanye	-9.89755
▁byanjye	-9.8977
▁Simeyoni	-9.898
▁bwayo	-9.89862
▁mazina	-9.89911
inkambi	-9.89926
▁indwara	-9.90204
▁rumwe	-9.90206
▁ushobora	-9.90208
▁Abatambyi	-9.9026
▁Sara	-9.90321
era	-9.90366
▁bat	-9.90572
▁bavandimwe	-9.90773
▁bandi	-9.91257
ubwo	-9.91355
umuvandimwe	-9.91362
▁maraso	-9.91424
ntu	-9.91462
▁R	-9.91465
igitsina	-9.91999
▁baje	-9.92033
▁Loti	-9.92058
▁Kalebu	-9.92071
▁Sinayi	-9.92072
▁Nili	-9.92152
maze	-9.92161
▁buteye	-9.92192
▁Ahaziya	-9.92198
▁apfa	-9.92325
▁ejo	-9.9239
▁icururutsa	-9.92438
▁dore	-9.92491
▁Asheri	-9.92509
▁ahagana	-9.92522
▁rwabo	-9.92629
▁Isakari	-9.9263
▁yinjira	-9.92842
▁Uyu	-9.92931
▁cyayo	-9.93031
▁nzi	-9.93219
▁ukomeye	-9.9328
ukuboko	-9.93813
▁babonye	-9.94257
isanduku	-9.9427
imigi	-9.94299
kuko	-9.94324
inka	-9.94336
▁umugati	-9.94338
rwa	-9.94446
▁Id	-9.94481
raga	-9.94712
Hadadi	-9.94835
▁Leya	-9.94835
▁Shemaya	-9.94858
kubera	-9.94937
▁araza	-9.94946
▁yatanze	-9.94983
indi	-9.9502
▁mbuga	-9.95065
urugimbu	-9.95193
▁Hiramu	-9.95289
▁95	-9.95399
▁asubira	-9.95422
▁Abasiriya	-9.95602
▁wundi	-9.95627
▁akajya	-9.95675
61	-9.95695
▁gukiranuka	-9.95783
▁icumu	-9.95971
imbohe	-9.9628
▁urubyaro	-9.96399
▁bakajya	-9.96486
▁kumva	-9.96493
▁urwo	-9.96504
▁ro	-9.96594
▁itagira	-9.96626
▁ziri	-9.9664
▁muriro	-9.96655
▁nto	-9.96663
ara	-9.96726
abari	-9.96811
▁yatumye	-9.97229
▁mubi	-9.97265
▁nt	-9.97431
▁reka	-9.97463
▁kibe	-9.97507
▁Rebeka	-9.977
▁muka	-9.977
▁Yosiya	-9.977
▁Amunoni	-9.97704
intare	-9.97705
▁gisangirwa	-9.97712
▁imyobo	-9.97717
▁Abagaragu	-9.97726
▁rwerekeye	-9.97748
▁mwiza	-9.97755
▁biciyemo	-9.97755
▁ihakikije	-9.97762
▁Kora	-9.97763
▁Ha	-9.97777
▁Murwa	-9.97781
▁ahagarara	-9.97841
bo	-9.97854
▁azi	-9.97857
▁ntoki	-9.97887
▁ukundi	-9.9799
amatara	-9.97998
▁bibaya	-9.98101
impumuro	-9.98119
▁kugenda	-9.98131
▁Ruzi	-9.98133
▁Bowazi	-9.9815
▁Ndetse	-9.98152
▁kuboko	-9.98211
▁eshatu	-9.98213
▁Uriya	-9.98219
▁bazaba	-9.98282
▁birindwi	-9.98286
▁ga	-9.9841
be	-9.9848
▁Zf	-9.98579
isha	-9.98658
▁ivu	-9.9871
▁bavuye	-9.98726
urubyaro	-9.98844
▁73	-9.98859
▁bashinzwe	-9.98862
▁Ya	-9.98996
▁amagare	-9.99007
▁yeli	-9.99026
Sheba	-9.99147
nze	-9.9916
kira	-9.99197
▁86	-9.99249
▁ibisate	-9.99257
amapfizi	-9.99366
▁amatungo	-9.99456
▁basigaye	-9.995
▁urugamba	-9.99599
amagare	-9.99682
muri	-9.99694
▁132	-10.0014
▁noneho	-10.0023
▁yubaka	-10.0028
kazi	-10.0033
▁Z	-10.0035
▁Nyina	-10.0063
▁Seyiri	-10.0064
▁ubufindo	-10.0065
▁Maze	-10.0067
▁ubwanjye	-10.0067
ana	-10.0073
▁Umu	-10.0078
▁rwanjye	-10.0079
▁bakurikije	-10.0081
▁ubudodo	-10.01
▁Shilo	-10.011
▁umushyitsi	-10.0112
▁kumenya	-10.0121
▁mafarashi	-10.0137
izo	-10.015
▁maturo	-10.0158
▁ikiri	-10.017
▁rwari	-10.0174
▁imfizi	-10.0176
▁bakoze	-10.0197
▁umumarayika	-10.0201
▁gushyira	-10.024
▁itungo	-10.0266
▁kuki	-10.0273
▁kera	-10.028
▁mabuye	-10.0292
iya	-10.03
jambo	-10.0302
▁ese	-10.0304
▁impuhwe	-10.0309
▁igi	-10.0311
▁dufite	-10.0313
▁gukorera	-10.0337
▁icya	-10.0342
▁ifu	-10.0349
▁90	-10.035
▁Ujye	-10.0351
▁kwi	-10.0356
abahanuzi	-10.0356
▁Rusi	-10.0358
baza	-10.0361
aya	-10.0362
▁Sihoni	-10.0366
▁basubira	-10.0367
▁Kiriyati	-10.0367
▁Isi	-10.037
▁ukuntu	-10.0377
▁bimeze	-10.0378
▁mato	-10.0389
▁Ari	-10.0391
▁arasubiza	-10.0401
▁kubyara	-10.0406
▁mwijima	-10.0409
▁Gilugali	-10.0415
▁uzajya	-10.0419
uw	-10.042
▁yindi	-10.0447
▁Aya	-10.0449
▁Ubu	-10.045
Aba	-10.0459
amaso	-10.0482
▁haba	-10.0485
ine	-10.0491
amasederi	-10.052
▁mazu	-10.0531
▁Araba	-10.0533
Mu	-10.0538
▁yapfuye	-10.0548
▁94	-10.0554
▁ivanze	-10.0564
▁rayeli	-10.0578
▁izaba	-10.059
iryo	-10.0602
▁kuza	-10.0607
▁139	-10.0629
▁ageze	-10.0629
geze	-10.0631
uma	-10.0644
rira	-10.0648
▁Libani	-10.0679
▁Gibeyoni	-10.0679
▁Abiyatari	-10.068
▁ibisekuru	-10.068
▁Aramusubiza	-10.0681
▁barahaguruka	-10.0681
▁ijosi	-10.0681
▁Abahungu	-10.0682
▁kikiri	-10.0689
▁bikomeye	-10.0689
Dn	-10.069
ki	-10.0699
▁gukomera	-10.0704
▁cyanyu	-10.0709
▁nshya	-10.0711
tura	-10.0712
zamuka	-10.0715
he	-10.0721
nge	-10.0723
▁mukurikije	-10.0723
▁Iminsi	-10.0729
▁baturutse	-10.0739
▁li	-10.0747
▁yikubita	-10.0756
▁bagaragu	-10.0762
▁bicuzwe	-10.0763
64	-10.0769
akomeje	-10.0775
▁ikuzo	-10.0776
▁igitero	-10.078
▁harimo	-10.079
▁bakomeje	-10.0791
▁ukaba	-10.0793
▁utuye	-10.08
abiri	-10.0808
urubanza	-10.0814
she	-10.0822
▁enye	-10.0833
▁Nyamara	-10.0834
▁impano	-10.0838
▁iburasirazuba	-10.0877
ere	-10.0878
iza	-10.0888
bi	-10.0902
ubwoya	-10.0913
▁ndwara	-10.0923
▁iza	-10.0935
▁aramu	-10.0956
▁Abamoni	-10.0956
▁bagira	-10.0966
imana	-10.0984
imyaka	-10.099
bwire	-10.0991
▁Asafu	-10.0993
isine	-10.0997
▁Ezira	-10.0997
▁ishozi	-10.1003
▁italanto	-10.1035
▁byanditswe	-10.1037
▁iz	-10.1042
▁ntiya	-10.1043
▁Nuni	-10.1053
▁yahaye	-10.1059
▁ube	-10.1081
▁mitwe	-10.1087
▁yakomeje	-10.1094
▁byayo	-10.1095
mubwire	-10.1101
▁Tt	-10.1101
▁Zabuloni	-10.1107
▁bamuhamba	-10.111
▁bitambo	-10.1128
▁yabyo	-10.1131
▁bitanu	-10.1131
urusengero	-10.1136
ngwino	-10.1137
▁rukuta	-10.1153
▁muzaba	-10.1154
▁yumva	-10.1158
bere	-10.1166
▁ubwe	-10.1186
▁intama	-10.1189
▁bamu	-10.1196
▁Tamari	-10.1216
▁impanda	-10.1217
▁ahera	-10.1233
▁yabi	-10.125
inkingi	-10.1272
izindi	-10.1274
▁Yo	-10.1301
▁gituza	-10.1329
ibyakozwe	-10.133
Ababenyamini	-10.1334
▁ipima	-10.1347
▁rifite	-10.1364
▁biganza	-10.137
▁igoswe	-10.1372
▁hanze	-10.1373
ibihumbi	-10.1373
▁cyiza	-10.1375
▁kwica	-10.1382
▁ikibi	-10.1385
▁Izo	-10.1389
▁kunywa	-10.1399
▁ibindi	-10.1411
jya	-10.142
▁mukungugu	-10.1428
▁nubwo	-10.1444
▁bibi	-10.1454
▁babaruwe	-10.1463
▁munani	-10.1467
▁wakoze	-10.147
▁kindi	-10.1472
▁bana	-10.1495
▁haje	-10.1498
▁inshingano	-10.15
▁Umunsi	-10.1501
▁99	-10.1519
▁Beni	-10.1524
▁atuye	-10.1528
▁babona	-10.1535
▁zera	-10.1545
▁amoko	-10.1547
▁Si	-10.1558
▁Ababaruwe	-10.1558
abaririmbyi	-10.16
ro	-10.1608
Gileyadi	-10.1614
mwe	-10.162
retse	-10.1636
▁ubutaka	-10.1642
Umu	-10.1643
▁biba	-10.1651
▁Ishoborabyose	-10.1652
▁ibibembe	-10.1661
▁Ababenyamini	-10.1663
▁Heshiboni	-10.1671
▁amaturo	-10.1673
▁yubamye	-10.1673
▁yabitegetse	-10.1674
▁Bahaguruka	-10.1674
▁ne	-10.1682
▁74	-10.1683
shobora	-10.1685
▁hino	-10.1687
▁145	-10.169
▁Nza	-10.1694
▁yicaye	-10.1702
▁ibe	-10.1709
▁yakoreye	-10.1709
▁bazi	-10.1715
▁bakobwa	-10.1719
Abanyakanani	-10.1732
▁rundi	-10.1733
▁Ishimayeli	-10.1733
▁asana	-10.1739
▁igiciro	-10.1739
▁biti	-10.1748
▁rutare	-10.1755
▁azana	-10.1767
▁ibiganza	-10.1792
▁Mikaya	-10.1796
▁Aha	-10.1803
iyi	-10.1805
iy	-10.1819
gire	-10.1831
▁akoranya	-10.1831
▁bamenya	-10.1836
▁53	-10.1841
batware	-10.1861
ibya	-10.1864
▁yaje	-10.19
▁iburyo	-10.1918
▁Nguko	-10.192
icyenda	-10.1933
oya	-10.194
▁ugiye	-10.1962
▁Abanyakanani	-10.1966
▁imeze	-10.1987
56	-10.2001
bonye	-10.2024
▁Obedi	-10.2028
▁rizunguzwa	-10.2029
▁urunuka	-10.2029
▁Reka	-10.2029
▁myenda	-10.2041
▁nd	-10.2042
▁batambyi	-10.2044
▁barindwi	-10.2053
ikimasa	-10.2057
▁arasohoka	-10.2057
vuga	-10.206
umwenda	-10.2065
▁izuba	-10.2068
iby	-10.2069
▁zanyu	-10.2073
▁yombi	-10.2076
ure	-10.208
▁mirima	-10.2081
Abayebusi	-10.2088
▁shobuja	-10.209
yeli	-10.2095
▁bata	-10.2105
▁mugabane	-10.2116
▁yi	-10.2116
▁ashyira	-10.2131
▁ryera	-10.2162
▁ikomeye	-10.2165
irindwi	-10.2177
tegeka	-10.2183
▁arangije	-10.2188
▁isoni	-10.219
▁bikoresho	-10.2202
▁bato	-10.2202
abarinzi	-10.2203
▁115	-10.221
arongera	-10.2211
▁Adoniya	-10.2216
ubugari	-10.2218
▁bakuru	-10.2221
▁Se	-10.2222
▁abigenza	-10.2224
▁magare	-10.2228
▁Bu	-10.2243
Rm	-10.2245
go	-10.2254
bwiye	-10.2257
abaja	-10.2271
▁yabahaye	-10.2278
▁Iyi	-10.229
▁impeta	-10.2331
▁nini	-10.2357
tangira	-10.2361
▁Abiya	-10.2375
▁ibishushanyo	-10.2377
amagambo	-10.2377
▁inkuru	-10.2388
umunyinya	-10.2399
ubutambyi	-10.2399
▁ibirindiro	-10.2399
▁Shalumu	-10.24
▁Yeshuwa	-10.2401
▁vuba	-10.2404
▁ino	-10.2407
▁Uziya	-10.241
▁Nk	-10.2413
▁bateranira	-10.2417
▁kuguha	-10.2421
▁bube	-10.2425
▁icuzwe	-10.2427
▁Abwira	-10.2429
▁Ima	-10.2438
▁bizaba	-10.2453
▁biza	-10.2455
▁gushaka	-10.2457
▁umurambo	-10.2462
▁ingano	-10.2466
68	-10.2474
vugana	-10.2482
Yb	-10.2515
▁acura	-10.2519
Abanyegiputa	-10.2525
▁gicu	-10.2527
▁amahembe	-10.2528
▁bumva	-10.2531
bu	-10.2534
▁ibirenge	-10.254
▁147	-10.2561
▁riri	-10.2562
▁inzozi	-10.2591
amafarashi	-10.264
▁ayi	-10.2643
▁agomba	-10.2671
▁baz	-10.2673
▁bakaba	-10.2675
mbese	-10.2691
data	-10.2695
▁Mujye	-10.2716
▁ah	-10.2728
▁abaha	-10.2729
▁umubiri	-10.275
tera	-10.2768
shyira	-10.2772
uza	-10.2773
▁Ahasuwerusi	-10.2783
▁Kadeshi	-10.2783
▁Merari	-10.2783
▁Bakomeza	-10.2789
▁yabyaranye	-10.279
▁Kuva	-10.2791
▁twose	-10.2791
▁batyo	-10.2797
▁bitagira	-10.2808
cc	-10.281
▁kuzana	-10.2824
▁kinini	-10.2829
nya	-10.2831
▁yazo	-10.284
▁Yefuta	-10.2848
▁Mwami	-10.2849
▁80	-10.285
59	-10.2855
▁urw	-10.2857
▁Misipa	-10.2862
▁mugoroba	-10.2865
▁irindi	-10.2878
▁muto	-10.2881
▁rubyaro	-10.2883
umunsi	-10.2888
▁Ibi	-10.2902
▁ata	-10.2903
rababwira	-10.2908
▁baha	-10.291
▁hema	-10.2911
▁Ndakwinginze	-10.2915
imi	-10.2924
▁umuriro	-10.2926
ravuga	-10.2952
▁bazana	-10.2955
▁Gu	-10.2959
▁bwari	-10.2964
Niba	-10.2972
imbuto	-10.2973
umwimukira	-10.2981
▁mbo	-10.2991
▁buriri	-10.3
▁guhagarara	-10.301
▁Basha	-10.3021
umuhanga	-10.3021
70	-10.3029
itwara	-10.304
ibirenge	-10.3045
Yk	-10.3045
▁nyu	-10.3047
▁ashobora	-10.3047
▁itsinda	-10.3073
umwaka	-10.3073
▁gutegeka	-10.3074
komeza	-10.3083
▁akarere	-10.3087
abagendera	-10.3094
▁umwijima	-10.3145
▁urugendo	-10.3146
▁96	-10.316
ibyishimo	-10.3169
▁ubutwari	-10.3175
▁bamara	-10.3176
▁Abishayi	-10.3183
inehasi	-10.3183
▁Sisera	-10.3183
▁rikomeye	-10.3186
▁intege	-10.3186
▁kwambuka	-10.3187
▁Zera	-10.319
▁byombi	-10.319
▁buvumo	-10.3202
▁Sa	-10.3208
▁yambaye	-10.3212
▁bushake	-10.3213
▁Uw	-10.3215
▁bwanyu	-10.3216
▁aramanuka	-10.3222
▁buntu	-10.3225
▁bitandatu	-10.3239
▁icyorezo	-10.3244
▁kuvugana	-10.3248
▁urugabano	-10.325
amagana	-10.3257
▁Nimu	-10.3287
▁Nawomi	-10.3317
ubuki	-10.3331
▁ibice	-10.3331
▁Ahiya	-10.3341
▁cyera	-10.3342
amahoro	-10.3344
▁amapfizi	-10.3347
emo	-10.3351
jwe	-10.337
▁igishushanyo	-10.3373
buri	-10.3375
▁gutera	-10.3383
▁bane	-10.3385
▁uburenganzira	-10.339
▁bageze	-10.3394
inyuma	-10.3397
imyambaro	-10.3397
▁yamu	-10.3399
▁batura	-10.3415
no	-10.3416
▁ib	-10.3431
▁muhanuzi	-10.3443
▁wera	-10.3458
ishe	-10.3459
Abasiriya	-10.3474
▁cyaha	-10.3492
▁iriba	-10.3492
▁inkambi	-10.3507
kugira	-10.3509
▁ibiti	-10.351
▁kwigomeka	-10.3588
▁Meshulamu	-10.36
▁Yabeshi	-10.36
Shemeshi	-10.36
▁Abigayili	-10.36
▁Hilukiya	-10.36
▁Bukeye	-10.36
▁yarabitegetse	-10.36
▁Nabali	-10.36
▁Nebati	-10.36
▁sayiri	-10.36
▁Seruya	-10.36
▁Yezebeli	-10.36
▁ntiyigeze	-10.36
▁sebukwe	-10.3601
▁ruhanga	-10.3601
▁Akomeza	-10.3608
▁gato	-10.3614
▁musaza	-10.3619
▁tujye	-10.3625
▁mwanya	-10.3625
▁ngutegeka	-10.3628
▁kigeze	-10.3633
▁tununga	-10.3633
ib	-10.3633
▁mukumbi	-10.3639
▁iy	-10.3648
▁bab	-10.365
▁atyo	-10.3655
▁amasekurume	-10.3664
▁Umumarayika	-10.367
▁kubana	-10.3674
▁muhungu	-10.368
▁bisate	-10.369
sanga	-10.3693
▁arazamuka	-10.3708
▁yahawe	-10.3731
mufate	-10.3737
▁yubatse	-10.3747
▁ntiba	-10.3754
▁bifite	-10.3755
▁yuzuye	-10.3757
▁ndogobe	-10.3757
▁wavuze	-10.3758
zana	-10.376
waga	-10.3763
uruzi	-10.3766
owe	-10.377
▁kumu	-10.3783
▁nzaba	-10.3788
ibyaha	-10.3802
▁kub	-10.3816
▁ag	-10.382
▁Sheba	-10.3824
rimo	-10.3839
▁kubaha	-10.3842
▁81	-10.3852
▁riba	-10.3865
65	-10.387
sa	-10.3901
geza	-10.3907
Abayuda	-10.3936
ngaho	-10.3957
▁Bi	-10.3967
▁ta	-10.3968
▁umwamikazi	-10.397
▁tse	-10.3973
▁ngu	-10.3985
▁yuda	-10.3993
▁Irembo	-10.3994
▁ibiki	-10.4009
mugende	-10.4013
ibumoso	-10.4015
▁mpa	-10.4022
Am	-10.4025
▁Karumeli	-10.4035
▁Negebu	-10.4035
▁Yubile	-10.4035
▁Elukana	-10.4035
▁Kohati	-10.4035
▁riranguruye	-10.4035
Igihamya	-10.4035
▁Yehowahazi	-10.4035
▁Hazayeli	-10.4035
▁Kishi	-10.4035
▁Nyanja	-10.4035
▁cyagenwe	-10.4035
korera	-10.4036
▁ibihembo	-10.4037
▁azamese	-10.4039
▁bugende	-10.4054
▁ibumoso	-10.4054
▁nkombe	-10.4056
▁zacyo	-10.4061
▁bahaguruka	-10.4068
itirirwa	-10.4068
asanga	-10.4071
▁mahema	-10.4073
▁ukingiriza	-10.4086
▁bashaka	-10.4104
▁NEHEMIYA	-10.4105
haguruka	-10.4107
▁Nanjye	-10.411
▁ahateganye	-10.4114
▁bikwiriye	-10.4121
▁bag	-10.4125
bihuje	-10.4136
▁mpinga	-10.414
▁bayi	-10.4142
kura	-10.4149
Ku	-10.4171
▁bavuza	-10.4177
▁utununga	-10.4179
▁Amaraso	-10.4181
▁ahandi	-10.4208
Ab	-10.4215
▁bica	-10.4229
Ibh	-10.4233
ke	-10.4234
tu	-10.4245
▁intumbi	-10.4252
▁umucamanza	-10.4254
mba	-10.4258
▁umugaba	-10.4263
▁ntiy	-10.4273
▁gitambaro	-10.4274
aka	-10.4286
▁ibikorwa	-10.431
▁waje	-10.4317
bwo	-10.4324
▁Uzi	-10.4341
▁byawe	-10.4356
▁icy	-10.4381
▁148	-10.4389
▁bakoraga	-10.4395
rya	-10.4413
▁97	-10.4413
amaboko	-10.4421
▁Imigi	-10.4424
waho	-10.4433
▁baho	-10.4454
▁ut	-10.4471
ubuhungiro	-10.4474
icuraburindi	-10.4489
▁Hadadezeri	-10.4489
Abaperizi	-10.4489
agahato	-10.4489
▁Ogi	-10.4489
▁Arunoni	-10.449
▁Ramoti	-10.449
umunyambaraga	-10.449
▁Mufilisitiya	-10.449
▁yabyariye	-10.4495
▁gatandatu	-10.4499
▁babigenza	-10.4501
ay	-10.4502
shi	-10.4503
ibibembe	-10.4505
▁yatoranyije	-10.4506
▁ntiyari	-10.4506
▁yab	-10.4509
▁Undi	-10.4509
ayi	-10.4511
▁hirya	-10.4512
▁yakoraga	-10.4515
Ef	-10.4528
▁uzakora	-10.4528
▁Im	-10.453
▁gitereko	-10.4532
▁bwami	-10.4546
▁bihugu	-10.4549
▁Obadiya	-10.4562
▁bukuru	-10.4563
▁ibizingiti	-10.4566
▁Abana	-10.4571
▁akurikiraho	-10.4583
▁ubwawe	-10.4584
hereza	-10.4592
▁Umwe	-10.4595
ranye	-10.4605
▁ahitwa	-10.4638
▁abasore	-10.464
▁wigeze	-10.4647
▁aje	-10.4652
▁127	-10.4656
▁ubabwire	-10.4659
None	-10.4659
▁barimo	-10.4678
▁tuza	-10.4679
▁yawo	-10.4684
▁te	-10.4686
▁ihembe	-10.469
▁amubwira	-10.4695
▁Ahera	-10.4703
▁ugomba	-10.4715
▁umucyo	-10.4716
▁ishyanga	-10.4719
imu	-10.4725
▁arakarira	-10.4735
▁Muza	-10.4735
urira	-10.4736
umutware	-10.4744
▁atanga	-10.4748
amashyo	-10.4763
▁igice	-10.4771
▁ikiganza	-10.4776
▁bahanuzi	-10.4785
▁mbwira	-10.4796
▁gusenga	-10.4797
ndahiye	-10.4799
▁ugende	-10.48
▁nyama	-10.4838
▁cyuzuye	-10.4842
▁yitwa	-10.4853
ikintu	-10.4882
▁ng	-10.4882
▁izi	-10.4911
▁bite	-10.4918
▁abi	-10.4926
▁azafate	-10.4929
▁ikaba	-10.494
▁imbaho	-10.4948
ubwenge	-10.4964
▁isengesho	-10.4965
▁Sodomu	-10.4965
▁Timuna	-10.4965
▁Yotamu	-10.4965
▁biyunze	-10.4965
▁Nadabu	-10.4966
▁gitambwa	-10.4966
▁Urwo	-10.4967
▁Umuhungu	-10.4967
▁Makiri	-10.4967
▁Eliyabu	-10.4967
▁ntibyanditse	-10.4968
▁Abeli	-10.4969
▁Ingabo	-10.497
▁Akishi	-10.497
▁Maka	-10.4975
▁Nubwo	-10.4976
▁Shela	-10.4976
▁kumvira	-10.4977
Edomu	-10.498
▁kibazo	-10.4982
ibwami	-10.4987
▁yagiraga	-10.4992
akuye	-10.5005
▁ntumbi	-10.5011
▁bajyana	-10.5013
babwire	-10.5013
▁yabaye	-10.5026
▁ibicaniro	-10.5028
▁mpera	-10.5031
icyubahiro	-10.5032
▁iwawe	-10.5036
▁bumvise	-10.5054
▁mpeta	-10.5071
▁ukurikije	-10.509
bwa	-10.5099
▁T	-10.5102
▁nz	-10.5115
imikumbi	-10.5118
akarere	-10.5122
▁imitima	-10.5127
▁kawe	-10.5142
riye	-10.5151
umuyaga	-10.5153
▁mutware	-10.5162
ije	-10.5163
▁amenya	-10.5163
▁utari	-10.5168
igicu	-10.5176
Umugabo	-10.5177
▁yicara	-10.5179
▁144	-10.5193
▁bongera	-10.5195
▁Abamidiyani	-10.5199
▁nsi	-10.5199
▁ziti	-10.5205
▁Umugore	-10.5206
▁Uri	-10.5207
▁nyamaswa	-10.5212
▁77	-10.5227
▁abarinzi	-10.5229
▁haza	-10.5236
sigaye	-10.5251
▁Abamaleki	-10.5258
reke	-10.5259
▁imi	-10.5278
aza	-10.5278
▁intebe	-10.5286
gwa	-10.5292
▁yatanzwe	-10.5293
▁109	-10.5293
ve	-10.5297
▁ikomeza	-10.5309
▁mugende	-10.5317
aha	-10.5319
▁babaru	-10.5319
gura	-10.5328
gize	-10.5333
▁akura	-10.5345
umwa	-10.5357
umukobwa	-10.5379
itandatu	-10.538
▁ibuye	-10.538
▁Hanani	-10.5397
▁bayo	-10.5414
▁Da	-10.5417
▁gare	-10.5428
mubwira	-10.5429
inkota	-10.5436
inyenyeri	-10.5442
▁Hana	-10.5461
▁bukaraze	-10.5465
▁kwicwa	-10.5466
▁Hamati	-10.5466
▁Itamari	-10.5466
▁gutata	-10.5466
▁Yoweli	-10.5467
▁Namani	-10.5467
▁rinini	-10.5469
▁Kuro	-10.5471
▁kwambara	-10.5471
▁gukomeye	-10.5472
▁barazamuka	-10.5472
▁Shemu	-10.5473
▁gituma	-10.5476
▁rwacyo	-10.5477
kora	-10.5486
ngwa	-10.5488
▁yarahiye	-10.5489
Kandi	-10.5495
▁bashinga	-10.5501
▁urya	-10.5509
Gl	-10.5513
▁Abamowabu	-10.5515
▁abishyira	-10.5517
▁abagize	-10.5518
mpa	-10.5522
▁ntimu	-10.5528
▁mpande	-10.5531
▁Iteraniro	-10.5545
umwuka	-10.5573
abwiye	-10.5589
none	-10.5592
inzara	-10.5627
▁Naboti	-10.5628
▁Mwa	-10.5645
▁jyewe	-10.5651
▁bake	-10.5657
▁mwese	-10.5658
▁amafarashi	-10.5665
▁amenye	-10.5669
ikiganza	-10.5672
▁uku	-10.5676
▁inka	-10.5677
▁baramu	-10.5686
▁isekurume	-10.5703
urukuta	-10.5704
▁iba	-10.5707
▁amababa	-10.5707
▁turo	-10.5708
so	-10.5716
▁146	-10.5724
ingamiya	-10.5725
▁nzajya	-10.5733
▁Azaba	-10.5737
bera	-10.576
icyuma	-10.5761
▁mbona	-10.5766
▁twari	-10.578
▁avuye	-10.5784
▁aga	-10.5787
▁nte	-10.579
▁ibikomangoma	-10.5814
▁kibi	-10.5823
Amen	-10.583
▁ako	-10.5856
▁bita	-10.5859
nde	-10.5873
ose	-10.588
▁inzugi	-10.5889
ibiguruka	-10.5899
▁mavuta	-10.5959
▁Abandi	-10.5982
Umuheti	-10.5992
▁Keyila	-10.5992
▁Manowa	-10.5992
▁Shushani	-10.5992
▁burundu	-10.5992
▁umumaro	-10.5992
Yeyarimu	-10.5992
▁itarengeje	-10.5992
▁Elifazi	-10.5992
▁Balewi	-10.5992
▁Damasiko	-10.5992
▁wakomotsweho	-10.5992
▁Muzatambe	-10.5993
abanyazi	-10.5993
▁kibajwe	-10.5994
imyelayo	-10.5994
▁Cyane	-10.5994
▁isano	-10.5995
▁bahuriraho	-10.5995
▁igico	-10.5996
▁Aramubwira	-10.5996
▁azatoranya	-10.5997
uburetwa	-10.5998
abazabakomokaho	-10.5998
igarurira	-10.5999
▁Aravuga	-10.6001
▁Ara	-10.6001
▁byacyo	-10.6003
▁Ela	-10.6004
impyiko	-10.6004
▁zigenda	-10.6005
▁Itukura	-10.6007
▁Nahori	-10.6008
▁ntumwa	-10.6009
▁uka	-10.6015
▁ingana	-10.6015
▁ushinzwe	-10.6015
▁yiruka	-10.6018
uru	-10.6029
▁tujyane	-10.6038
Hs	-10.604
▁kwabo	-10.6045
▁kuruza	-10.6056
▁Eni	-10.6057
▁bamuzanira	-10.6065
korere	-10.6065
▁binjira	-10.6073
▁Amoni	-10.6075
▁amusimbura	-10.6075
▁rwayo	-10.6082
▁mbe	-10.6092
Mk	-10.6099
▁busitani	-10.6101
▁muzajya	-10.6104
ahantu	-10.6111
▁ameza	-10.6113
▁azazane	-10.6116
▁abwi	-10.6119
in	-10.614
57	-10.614
itegeko	-10.6152
▁bahagarara	-10.6157
oti	-10.6159
19–	-10.6162
▁igikombe	-10.6162
▁ububasha	-10.6163
▁ubushobozi	-10.6164
meze	-10.6164
▁bam	-10.6178
ngo	-10.618
shinga	-10.6186
▁nzozi	-10.619
te	-10.6194
▁mushobora	-10.6198
▁ita	-10.6206
▁mbyi	-10.6216
▁arambura	-10.6218
▁nkuru	-10.6219
isabato	-10.6221
▁nkuta	-10.6223
ibisate	-10.6237
▁imikono	-10.6242
yajyaga	-10.6243
turi	-10.6243
▁uturutse	-10.6261
wo	-10.6265
▁ruri	-10.6268
▁abibonye	-10.6274
koreye	-10.6276
▁batwara	-10.6278
teye	-10.6279
▁Bara	-10.6279
Abamidiyani	-10.6281
babere	-10.6288
cyo	-10.6289
isekurume	-10.6315
▁ureke	-10.6335
▁ibirori	-10.6343
Est	-10.6346
▁biteye	-10.6348
ahandi	-10.6349
umva	-10.6354
▁bah	-10.6366
▁Uz	-10.6377
Umulewi	-10.6387
▁akiriho	-10.6391
▁64	-10.6391
▁Data	-10.6413
fite	-10.6422
ubuhagarike	-10.6423
▁bakore	-10.6428
mureke	-10.6428
▁mwari	-10.6443
▁imbe	-10.6449
ubwire	-10.6451
▁aki	-10.6452
▁gutaka	-10.6461
komeze	-10.6467
Abakohati	-10.647
umupfakazi	-10.6472
akomokwa	-10.6474
▁136	-10.6489
rye	-10.6505
▁mugiye	-10.6525
▁Afata	-10.6534
▁kun	-10.6541
Ikirenga	-10.6547
▁Lakishi	-10.6547
▁Gehazi	-10.6547
eshanu	-10.6547
▁umugogo	-10.6548
▁umugongo	-10.6548
▁Batisheba	-10.6548
▁ngombwa	-10.6548
▁ukore	-10.6548
▁yakomotsweho	-10.6548
▁Baramusubiza	-10.6549
▁guverineri	-10.6549
▁Sarayi	-10.6549
▁ingwate	-10.655
▁yabategetse	-10.6551
▁Ko	-10.6552
abanyamahanga	-10.6553
▁nyoko	-10.6553
▁igitabo	-10.6555
▁riza	-10.6556
▁kurimburwa	-10.6556
nimugende	-10.6557
▁ahumura	-10.6558
▁uwera	-10.6562
▁nkuge	-10.6562
▁batandatu	-10.6572
▁cyacyo	-10.6572
▁aryamana	-10.6575
▁bubiko	-10.6576
▁ibanga	-10.6589
▁batari	-10.659
▁byuzuye	-10.6592
▁musore	-10.6598
▁kizabe	-10.6598
▁bambaye	-10.6607
▁tungo	-10.6609
▁nkengero	-10.6615
▁bashoboye	-10.6616
gi	-10.6627
▁bahagaze	-10.6629
▁Umwuka	-10.663
▁mfizi	-10.663
▁Asaheli	-10.663
▁Ahimeleki	-10.6631
▁umwambaro	-10.6633
▁Abagabo	-10.6635
▁76	-10.6654
iriza	-10.6659
▁kanjye	-10.6659
▁bizingiti	-10.6665
umuganura	-10.6666
▁umeze	-10.6666
anye	-10.6681
▁akimara	-10.6681
▁ryayo	-10.6697
▁arahindukira	-10.6705
▁Az	-10.6719
▁Kayini	-10.6726
▁Harani	-10.6726
Abantu	-10.6732
▁gusanganira	-10.6736
zane	-10.6757
▁gice	-10.6762
Dawidi	-10.6764
▁ur	-10.6765
kubita	-10.6766
ahura	-10.6775
vu	-10.6786
▁inzabibu	-10.6789
▁kongera	-10.6802
▁kwinjira	-10.6811
▁mama	-10.6815
areka	-10.6815
▁ikoraniro	-10.6822
▁ubugari	-10.6829
▁ivuga	-10.6845
ibyago	-10.6845
▁wumve	-10.6847
umuja	-10.6853
umubavu	-10.6856
▁urukuta	-10.6867
habwa	-10.6868
▁atagira	-10.6871
▁abimukira	-10.6871
ubuzima	-10.6875
▁bakorera	-10.6882
▁D	-10.6886
▁Abamori	-10.689
▁umenye	-10.6898
imfizi	-10.6898
hagarara	-10.6901
▁inkwi	-10.6912
▁ukagera	-10.6916
▁bagende	-10.6929
▁bwaho	-10.6929
▁ukomeza	-10.6934
subira	-10.6935
▁ntihagire	-10.6938
▁amezi	-10.6945
ugire	-10.6949
▁imikumbi	-10.6952
mwami	-10.696
▁Nti	-10.6961
▁kuzamuka	-10.6961
▁Abarubeni	-10.6967
Zk	-10.6967
iz	-10.697
▁menye	-10.6972
ibyuma	-10.6976
emera	-10.699
urwo	-10.699
shyire	-10.7005
reba	-10.702
▁umurima	-10.703
ibwira	-10.7052
▁ashyiraho	-10.7058
yeho	-10.7058
▁im	-10.7059
urubura	-10.7068
abacamanza	-10.7069
▁Amasa	-10.707
injira	-10.7072
▁am	-10.7085
▁cyaba	-10.7112
▁agakiza	-10.7121
▁67	-10.7122
▁Eliyashibu	-10.7136
▁Tirusa	-10.7136
▁Tobiya	-10.7136
▁ZAB	-10.7136
▁Maseya	-10.7136
▁Ataliya	-10.7136
▁kirekire	-10.7136
▁Ekuroni	-10.7136
▁Mataniya	-10.7136
▁Omuri	-10.7136
▁gitemba	-10.7136
▁azatangaze	-10.7137
▁gucumura	-10.7138
▁birangiye	-10.714
▁Abavandimwe	-10.7141
▁yamutegetse	-10.7141
▁urwaye	-10.7142
▁Huri	-10.7146
umupfundikizo	-10.7148
▁zabyo	-10.7149
▁ibakure	-10.7154
▁Bose	-10.7154
▁gikozwe	-10.7157
▁Hori	-10.7158
▁batanze	-10.7163
▁Siba	-10.7163
icy	-10.7164
▁tuti	-10.7167
meza	-10.7175
▁munwa	-10.7178
▁Gaza	-10.7191
▁yohereje	-10.7194
▁yiyuhagire	-10.7196
▁mubiri	-10.7197
icyumba	-10.7199
▁Ahitofeli	-10.7206
▁bakoreraga	-10.7217
▁akurwe	-10.722
▁EZIRA	-10.7221
shaka	-10.7222
ubw	-10.7222
▁Hesironi	-10.7225
▁yigarurira	-10.7226
ita	-10.7232
▁bahabwa	-10.7235
80	-10.7236
▁amata	-10.7238
▁amushyira	-10.7259
▁gufata	-10.726
izina	-10.7262
▁asaba	-10.7268
▁ahagaze	-10.7287
ic	-10.7288
▁rugendo	-10.7291
▁imijishi	-10.7294
zanire	-10.7297
utwara	-10.7302
komeje	-10.7303
▁midugudu	-10.7308
▁rwanyu	-10.7322
▁urutoki	-10.7323
fatiro	-10.7323
▁ikanzu	-10.7326
▁bagize	-10.7327
▁ibinyoma	-10.7328
▁Abi	-10.7333
▁Ituro	-10.7334
▁amagufwa	-10.7341
▁Abami	-10.7344
bura	-10.7354
▁tugiye	-10.7381
▁bikaba	-10.7382
▁umukumbi	-10.7386
▁yita	-10.7387
▁ate	-10.7399
eza	-10.7403
▁ubwinshi	-10.7423
manuka	-10.7446
kure	-10.7447
imbaraga	-10.7447
▁ashinzwe	-10.7458
▁ikirenge	-10.748
▁62	-10.7483
▁wishe	-10.7484
ababi	-10.7484
imyenda	-10.7489
▁ijisho	-10.7492
▁kubaza	-10.7499
▁Abari	-10.7505
▁ubona	-10.7515
zamuke	-10.7518
▁kira	-10.7523
umuhanuzi	-10.7549
▁kurwanya	-10.7552
▁Ana	-10.7554
▁ameze	-10.7558
Abayahudi	-10.7558
mbuka	-10.7559
▁ijya	-10.7572
ibimasa	-10.7574
▁baturage	-10.7577
▁bakomoka	-10.7584
bari	-10.7586
▁ubwire	-10.7593
▁bararya	-10.7598
▁ruza	-10.7613
▁aku	-10.7634
ongera	-10.7653
Isirayeli	-10.7662
▁sin	-10.768
rambura	-10.7689
ejo	-10.7693
uye	-10.7697
kubise	-10.7697
▁ig	-10.7698
▁umwanzi	-10.7719
umukono	-10.7731
▁bakiri	-10.7735
▁byaba	-10.7744
uburiza	-10.7744
▁gihu	-10.7758
▁Ahitubu	-10.7761
▁Debora	-10.7761
▁Eguloni	-10.7761
▁Mefibosheti	-10.7761
▁Sikulagi	-10.7761
▁Sukoti	-10.7761
▁Horebu	-10.7761
▁Shafani	-10.7761
▁Yehiyeli	-10.7761
▁Hemani	-10.7761
▁amaherezo	-10.7761
▁Sedekiya	-10.7761
▁Elihu	-10.7761
Abagerushoni	-10.7761
Abaheti	-10.7762
▁Uziyeli	-10.7762
▁Mikali	-10.7763
▁mikuru	-10.7764
▁icyiza	-10.7764
▁umwanya	-10.7765
▁kwigarurira	-10.7765
igiheburayo	-10.7765
▁imigabane	-10.7765
▁byazo	-10.7767
nimuze	-10.7768
▁ahumanutse	-10.777
abahanga	-10.7772
▁Neri	-10.7773
▁cyemejwe	-10.7775
▁batigeze	-10.7777
▁yampaye	-10.7778
▁baramusubiza	-10.778
▁basingiza	-10.7781
gatera	-10.7785
▁yategekaga	-10.7788
▁abahanuzi	-10.7789
▁atura	-10.779
▁arambwira	-10.7792
▁hini	-10.7792
ikibaya	-10.7797
▁agaruka	-10.7797
▁75	-10.781
kintu	-10.7813
▁atunze	-10.7814
▁91	-10.7819
▁bagomba	-10.7821
▁ntonnye	-10.7822
▁uvuga	-10.7824
▁gukomeza	-10.7826
▁bikubita	-10.7827
▁bubaka	-10.7835
kuruta	-10.7837
▁muzi	-10.7843
▁Ahimasi	-10.7851
mwa	-10.7864
▁mumenye	-10.7876
amakuba	-10.7877
▁ug	-10.7878
mbaraga	-10.7878
Nu	-10.7879
▁kari	-10.7883
▁shyanga	-10.7886
▁war	-10.789
ahabwa	-10.7894
▁yaravuze	-10.7898
ubaka	-10.79
tega	-10.7906
▁bamuha	-10.7907
▁ruka	-10.791
▁impu	-10.7911
▁arabasubiza	-10.7911
▁inkuta	-10.7912
tinya	-10.7916
▁mbese	-10.7921
▁basubiza	-10.7925
▁banga	-10.7932
▁ibyuma	-10.7938
▁ntari	-10.7941
▁guca	-10.7951
▁bimasa	-10.7954
sezerano	-10.7954
▁adahumanye	-10.7955
wi	-10.7956
▁mahembe	-10.7958
▁Hasori	-10.7959
▁Peresi	-10.7959
▁yishe	-10.797
▁Ubwo	-10.7975
▁murya	-10.7982
▁zitwa	-10.7987
▁babe	-10.7996
Abaheburayo	-10.8005
mana	-10.8006
▁isambu	-10.801
▁ukwezi	-10.8013
▁Be	-10.8014
▁mukomeza	-10.8014
▁tega	-10.802
▁agahinda	-10.8025
amahwa	-10.8034
▁ibyari	-10.8037
▁Ashyira	-10.8043
▁nyi	-10.8049
▁indirimbo	-10.8067
▁Umunaziri	-10.8069
▁Yesaya	-10.807
▁ugeze	-10.807
▁Ntimukagire	-10.8071
▁mbuto	-10.8076
bisobanuro	-10.8107
inzira	-10.8119
yose	-10.812
Nuko	-10.8141
asigaye	-10.8151
▁ukuri	-10.8157
Dore	-10.8172
▁bikorwa	-10.818
imwe	-10.819
▁wako	-10.8193
▁umunani	-10.8195
itako	-10.8196
ag	-10.8199
▁Nu	-10.8202
zo	-10.8207
▁mo	-10.8216
▁ntaza	-10.8229
▁aturutse	-10.8234
akoreshejwe	-10.8241
ica	-10.8249
▁bik	-10.8253
baga	-10.8267
zwe	-10.8274
▁yagiye	-10.8276
▁urebe	-10.8283
enda	-10.8298
uburebure	-10.83
zaga	-10.8301
ramo	-10.8309
▁mube	-10.831
amabwiriza	-10.8321
▁mut	-10.8323
▁ashinga	-10.8328
imvura	-10.8346
▁ubi	-10.8354
vuye	-10.8358
▁rusalemu	-10.8365
▁wabaye	-10.8367
yanditse	-10.8375
kwiriye	-10.8375
agendaga	-10.8379
italanto	-10.8383
62	-10.8387
ukuntu	-10.8389
▁akanwa	-10.8397
▁nihagira	-10.8398
▁Aroweri	-10.8427
▁Hashabiya	-10.8427
▁IGITABO	-10.8427
▁Befurayimu	-10.8427
▁Gezeri	-10.8427
Umwisirayeli	-10.8427
▁Amuramu	-10.8427
▁Urugabano	-10.8428
▁runaka	-10.8428
Umunyu	-10.8428
▁inteko	-10.8428
uwishwe	-10.8428
▁Satani	-10.8428
▁Dawi	-10.8428
▁Hagari	-10.8429
▁yarabivuze	-10.8429
▁Geba	-10.843
▁bigatuma	-10.843
▁barahunga	-10.8431
ibona	-10.8432
inuma	-10.8433
▁Elamu	-10.8433
▁Isiraye	-10.8435
▁bigaragara	-10.8437
▁zifite	-10.8438
▁byerekeza	-10.8443
▁idirishya	-10.8444
▁kuriramo	-10.8444
▁basana	-10.8445
▁barangije	-10.8447
nd	-10.8452
umukungugu	-10.8454
▁genda	-10.8457
▁kwita	-10.8464
▁bakoresheje	-10.8464
umwanzi	-10.8476
▁ndirimbo	-10.8483
kurikira	-10.8487
akanwa	-10.8492
▁ururimi	-10.8492
▁Buyu	-10.8499
inshoreke	-10.85
▁Amazi	-10.85
▁Bani	-10.8504
izi	-10.851
anga	-10.8516
▁abashobora	-10.8516
▁yagize	-10.8519
▁iramubwira	-10.8522
▁buba	-10.8522
▁Buperesi	-10.8523
▁nzabaha	-10.8524
bitambo	-10.8527
▁turere	-10.8529
▁bajyaga	-10.8534
▁ategura	-10.8543
▁nabonye	-10.8546
▁Amaso	-10.8548
uruhu	-10.8554
ashoboraga	-10.856
▁namara	-10.8562
▁awu	-10.8564
ibifite	-10.8564
ge	-10.8581
▁ban	-10.8584
eka	-10.859
▁ik	-10.8592
amaguru	-10.8595
byo	-10.8605
▁Mi	-10.8609
mi	-10.8613
▁utwo	-10.8617
sohora	-10.8622
▁yaryo	-10.8627
▁ibyumba	-10.8636
▁inyamaswa	-10.8636
▁imbabazi	-10.8638
▁agende	-10.8649
▁bwoya	-10.8655
▁azabaha	-10.8656
izababere	-10.8657
▁Ntimuza	-10.8664
▁wazaga	-10.8666
ibimera	-10.867
▁ngoro	-10.8678
▁wahawe	-10.8682
▁61	-10.8684
▁nya	-10.8684
▁yabaga	-10.8684
▁utinya	-10.8687
an	-10.8705
rire	-10.8733
▁imirima	-10.8733
▁Nzi	-10.8735
gendera	-10.874
uje	-10.8742
▁umusore	-10.8751
▁umuheto	-10.8753
▁140	-10.8753
teza	-10.8757
▁igira	-10.8764
▁yahoze	-10.877
abe	-10.8773
▁ashishimura	-10.8776
▁guking	-10.8776
wowe	-10.8789
▁kubi	-10.8793
▁ingamiya	-10.8793
▁Inzu	-10.8795
▁bashyira	-10.8796
uturutse	-10.8807
umviye	-10.8811
irya	-10.8816
Icyo	-10.8824
ibyari	-10.8831
hunga	-10.8831
byumva	-10.8832
▁92	-10.884
▁hera	-10.8847
ibuka	-10.8847
vuze	-10.8851
nzandiko	-10.8853
Y	-10.8862
agira	-10.8862
buhinduzi	-10.8864
▁umwuzukuru	-10.8871
▁Amagambo	-10.8876
amara	-10.8893
▁baramanuka	-10.8894
▁Umwa	-10.8898
▁ngira	-10.8899
▁batambira	-10.89
koze	-10.8915
databuja	-10.894
menye	-10.8957
eze	-10.8975
▁ubuhanga	-10.8985
▁azajya	-10.8991
▁ncuro	-10.8993
▁Abisira	-10.9003
▁intwari	-10.9008
amo	-10.9009
Ni	-10.9018
Bayali	-10.9038
twaye	-10.904
ufite	-10.9046
▁akoresheje	-10.9046
▁mwi	-10.9047
▁kum	-10.9047
ahawe	-10.9052
▁Ntuza	-10.9055
▁azanye	-10.9056
Amg	-10.9068
senga	-10.907
▁hugu	-10.9071
▁arab	-10.9083
cira	-10.9085
miryango	-10.9092
muzane	-10.9096
▁urwibutso	-10.9101
▁Rimoni	-10.9101
▁150	-10.9102
▁umukungugu	-10.9117
migati	-10.9118
▁zacu	-10.9133
▁aca	-10.9136
Horoni	-10.9142
▁Barizilayi	-10.9142
▁Gosheni	-10.9142
▁Nebukadinezari	-10.9142
▁Netaneli	-10.9142
▁Yedutuni	-10.9142
▁nebelu	-10.9142
imikindo	-10.9142
▁Midiyani	-10.9142
▁atarengeje	-10.9142
▁Hoseya	-10.9142
▁Yefune	-10.9142
▁karubanda	-10.9142
▁Yowashi	-10.9142
▁Bafilisitiya	-10.9142
▁Eberi	-10.9142
▁Yeremiya	-10.9142
▁Bela	-10.9142
▁Yerubayali	-10.9142
▁ubusembwa	-10.9142
